[
    {
        "Assessment Name": "District/Regional Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/districtregional-manager-solution/",
        "Description": "The District/Regional Manager solution is for mid- to senior-level managerial positions that oversee multiple stores within a defined area.  Sample tasks for these jobs include, but are not limited to: directing a group of supervisors or managers, having profit and loss responsibility for a district or region, and aligning work with overall company goals.  Potential job titles that use this solution are: Regional Director, District Manager, General Manager, Regional Manager, Store Manager, and Area Manager. There are multiple configurations and versions of this solution available.",
        "Duration": "65",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Manager,",
        "Cleaned Description": "districtregional manager solution mid seniorlevel managerial position oversee multiple store within defined area sample task job include limited directing group supervisor manager profit loss responsibility district region aligning work overall company goal potential job title use solution regional director district manager general manager regional manager store manager area manager multiple configuration version solution available",
        "cleaned_full_text": "District/Regional Manager Solution. districtregional manager solution mid seniorlevel managerial position oversee multiple store within defined area sample task job include limited directing group supervisor manager profit loss responsibility district region aligning work overall company goal potential job title use solution regional director district manager general manager regional manager store manager area manager multiple configuration version solution available"
    },
    {
        "Assessment Name": "Entry Level Cashier 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-cashier-7-1-%28americas%29/",
        "Description": "The Entry level Cashier 7.1 solution is for entry-level retail positions in which employees receive payment in the form of cash, check, or credit cards for goods purchased. Sample tasks for these jobs include, but are not limited to: handling payments, offering customer service, and issuing receipts and refunds. Potential job titles that use this solution are: Cashier, Sales Associate, and Clerk.",
        "Duration": "18",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, P, A",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level cashier solution entrylevel retail position employee receive payment form cash check credit card good purchased sample task job include limited handling payment offering customer service issuing receipt refund potential job title use solution cashier sale associate clerk",
        "cleaned_full_text": "Entry Level Cashier 7.1 (Americas). entry level cashier solution entrylevel retail position employee receive payment form cash check credit card good purchased sample task job include limited handling payment offering customer service issuing receipt refund potential job title use solution cashier sale associate clerk"
    },
    {
        "Assessment Name": "Entry Level Cashier 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-cashier-7-1-%28international%29/",
        "Description": "The Entry level Cashier 7.1 solution is for entry-level retail positions in which employees receive payment in the form of cash, check, or credit cards for goods purchased. Sample tasks for these jobs include, but are not limited to: handling payments, offering customer service, and issuing receipts and refunds. Potential job titles that use this solution are: Cashier, Sales Associate, and Clerk.",
        "Duration": "18",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level cashier solution entrylevel retail position employee receive payment form cash check credit card good purchased sample task job include limited handling payment offering customer service issuing receipt refund potential job title use solution cashier sale associate clerk",
        "cleaned_full_text": "Entry Level Cashier 7.1 (International). entry level cashier solution entrylevel retail position employee receive payment form cash check credit card good purchased sample task job include limited handling payment offering customer service issuing receipt refund potential job title use solution cashier sale associate clerk"
    },
    {
        "Assessment Name": "Entry Level Customer Service 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-customer-service-7-1-%28americas%29/",
        "Description": "The Entry Level Customer Service Solution (Retail and Contact Center) 7.1 is for entry-level positions in which employees interact with customers by providing information or carrying out customer requests related to an organizations products or services. Sample tasks for these jobs include, but are not limited to: interacting with customers on the phone or in person; taking orders; solving product or service issues; and responding positively to difficult or irate customers.“IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International, South Africa and Americas\".",
        "Duration": "19",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "C, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level customer service solution retail contact center entrylevel position employee interact customer providing information carrying customer request related organization product service sample task job include limited interacting customer phone person taking order solving product service issue responding positively difficult irate customersimportant please note need select correct package depending norm intend use package available product international south africa america",
        "cleaned_full_text": "Entry Level Customer Service 7.1 (Americas). entry level customer service solution retail contact center entrylevel position employee interact customer providing information carrying customer request related organization product service sample task job include limited interacting customer phone person taking order solving product service issue responding positively difficult irate customersimportant please note need select correct package depending norm intend use package available product international south africa america"
    },
    {
        "Assessment Name": "Entry Level Customer Service 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-customer-service-%28retail-and-cc%29-7-1/",
        "Description": "The Entry Level Customer Service Solution (Retail and Contact Center) 7.1 is for entry-level positions in which employees interact with customers by providing information or carrying out customer requests related to an organizations products or services. Sample tasks for these jobs include, but are not limited to: interacting with customers on the phone or in person; taking orders; solving product or service issues; and responding positively to difficult or irate customers.“IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International, South Africa and Americas\".",
        "Duration": "19",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "C, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level customer service solution retail contact center entrylevel position employee interact customer providing information carrying customer request related organization product service sample task job include limited interacting customer phone person taking order solving product service issue responding positively difficult irate customersimportant please note need select correct package depending norm intend use package available product international south africa america",
        "cleaned_full_text": "Entry Level Customer Service 7.1 (International). entry level customer service solution retail contact center entrylevel position employee interact customer providing information carrying customer request related organization product service sample task job include limited interacting customer phone person taking order solving product service issue responding positively difficult irate customersimportant please note need select correct package depending norm intend use package available product international south africa america"
    },
    {
        "Assessment Name": "Entry Level Customer Service 7.1 (South Africa)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-customer-service-7-1-%28south-africa%29/",
        "Description": "The Entry Level Customer Service Solution (Retail and Contact Center) 7.1 is for entry-level positions in which employees interact with customers by providing information or carrying out customer requests related to an organization's products or services. Sample tasks for these jobs include but are not limited to interacting with customers on the phone or in person; taking orders; solving product or service issues; and responding positively to difficult or irate customers.  “IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International, South Africa and Americas\".",
        "Duration": "19",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "C, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level customer service solution retail contact center entrylevel position employee interact customer providing information carrying customer request related organization product service sample task job include limited interacting customer phone person taking order solving product service issue responding positively difficult irate customer important please note need select correct package depending norm intend use package available product international south africa america",
        "cleaned_full_text": "Entry Level Customer Service 7.1 (South Africa). entry level customer service solution retail contact center entrylevel position employee interact customer providing information carrying customer request related organization product service sample task job include limited interacting customer phone person taking order solving product service issue responding positively difficult irate customer important please note need select correct package depending norm intend use package available product international south africa america"
    },
    {
        "Assessment Name": "Entry level Sales 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-sales-7-1-%28americas%29/",
        "Description": "The Entry Level Sales 7.1 Solution is for entry-level positions in which employees proactively sell products or services to customers and have their compensation and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: promoting products to customers, persuading customers to buy products, and completing a transaction with a customer.",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level sale solution entrylevel position employee proactively sell product service customer compensation andor performance based sale revenue sample task job include limited promoting product customer persuading customer buy product completing transaction customer",
        "cleaned_full_text": "Entry level Sales 7.1 (Americas). entry level sale solution entrylevel position employee proactively sell product service customer compensation andor performance based sale revenue sample task job include limited promoting product customer persuading customer buy product completing transaction customer"
    },
    {
        "Assessment Name": "Entry level Sales 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-sales-7-1/",
        "Description": "The Entry Level Sales 7.1 Solution is for entry-level positions in which employees proactively sell products or services to customers and have their compensation and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: promoting products to customers, persuading customers to buy products, and completing a transaction with a customer.\nReport Language Availability: English (USA), English International,     Portuguese, French Canadian, German, French, Chinese Simplified, Spanish, North American Spanish.",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "P, B, C",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level sale solution entrylevel position employee proactively sell product service customer compensation andor performance based sale revenue sample task job include limited promoting product customer persuading customer buy product completing transaction customer report language availability english usa english international portuguese french canadian german french chinese simplified spanish north american spanish",
        "cleaned_full_text": "Entry level Sales 7.1 (International). entry level sale solution entrylevel position employee proactively sell product service customer compensation andor performance based sale revenue sample task job include limited promoting product customer persuading customer buy product completing transaction customer report language availability english usa english international portuguese french canadian german french chinese simplified spanish north american spanish"
    },
    {
        "Assessment Name": "Entry Level Sales Sift Out 7.1",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/entry-level-sales-sift-out-7-1/",
        "Description": "The Entry Level Sales Sift Out 7.1 Solution is for entry-level positions in which employees proactively sell products or services to customers and have their compensation and/or performance based on sales revenue. Sample tasks for these jobs include, but are not limited to: promoting products to customers, persuading customers to buy products, and completing a transaction with a customer",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "C, P, B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "entry level sale sift solution entrylevel position employee proactively sell product service customer compensation andor performance based sale revenue sample task job include limited promoting product customer persuading customer buy product completing transaction customer",
        "cleaned_full_text": "Entry Level Sales Sift Out 7.1. entry level sale sift solution entrylevel position employee proactively sell product service customer compensation andor performance based sale revenue sample task job include limited promoting product customer persuading customer buy product completing transaction customer"
    },
    {
        "Assessment Name": "Event Sales Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/event-sales-manager-solution/",
        "Description": "The Event Sales Manager solution is designed for management level positions in the hospitality industry. Sample tasks include selling use of facility space for special events and managing staff. The solution is focused on sales, solving problems and making good decisions. Potential job titles that use this solution are: Event Sales Manager, Events Manager and Special Events Manager. Multiple configurations of this solution are available.",
        "Duration": "50",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "S, A, B, P",
        "Job Level": "Supervisor, Front Line Manager, Manager,",
        "Cleaned Description": "event sale manager solution designed management level position hospitality industry sample task include selling use facility space special event managing staff solution focused sale solving problem making good decision potential job title use solution event sale manager event manager special event manager multiple configuration solution available",
        "cleaned_full_text": "Event Sales Manager Solution. event sale manager solution designed management level position hospitality industry sample task include selling use facility space special event managing staff solution focused sale solving problem making good decision potential job title use solution event sale manager event manager special event manager multiple configuration solution available"
    },
    {
        "Assessment Name": "Executive - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/executive-short-form/",
        "Description": "The Executive solution is intended for use with senior executive level positions responsible for planning, directing, or coordinating key business activities and operations at the highest level of an organization. Executives at this level often accomplish their work through subordinate executives and provide overall direction to their organization by determining and formulating policies within guidelines set up by a board of directors or similar governing body. Potential job titles that use this solution are: Executive Vice President, President, and Executive Director.",
        "Duration": "74",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Executive,",
        "Cleaned Description": "executive solution intended use senior executive level position responsible planning directing coordinating key business activity operation highest level organization executive level often accomplish work subordinate executive provide overall direction organization determining formulating policy within guideline set board director similar governing body potential job title use solution executive vice president president executive director",
        "cleaned_full_text": "Executive - Short Form. executive solution intended use senior executive level position responsible planning directing coordinating key business activity operation highest level organization executive level often accomplish work subordinate executive provide overall direction organization determining formulating policy within guideline set board director similar governing body potential job title use solution executive vice president president executive director"
    },
    {
        "Assessment Name": "Financial Professional - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/financial-professional-short-form/",
        "Description": "This solution is for mid-level financial institution positions that require Series 6/7 certification. Candidates answer multiple choice questions to measure financial professional aptitude, learning potential, achievement orientation, conscientiousness, persistence and planfulness, self leadership, interpersonal leadership, sales focus and customer focus.",
        "Duration": "35",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Mid-Professional, Professional Individual Contributor,",
        "Cleaned Description": "solution midlevel financial institution position require series certification candidate answer multiple choice question measure financial professional aptitude learning potential achievement orientation conscientiousness persistence planfulness self leadership interpersonal leadership sale focus customer focus",
        "cleaned_full_text": "Financial Professional - Short Form. solution midlevel financial institution position require series certification candidate answer multiple choice question measure financial professional aptitude learning potential achievement orientation conscientiousness persistence planfulness self leadership interpersonal leadership sale focus customer focus"
    },
    {
        "Assessment Name": "Financial Services Representative Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/financial-services-representative-solution/",
        "Description": "The Financial Services Representative solution is for senior-level professional positions in the insurance industry that sell life insurance to businesses and individuals on behalf of insurance companies. Sample tasks for this position include, but are not limited to: calling on policyholders to deliver and explain policies or suggest additions or changes; calculating premiums; customizing insurance programs to suite individual customers; seeking out new clients and developing clientele by networking; ensuring policy requirements are fulfilled; and conferring with clients to obtain and provide information when calims are made on a policy. Potential job titles that use this solution are: Life Insurance Sales Professional, Insurance Sales Agent. Multiple configurations of this solution are available.",
        "Duration": "44",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Professional Individual Contributor,",
        "Cleaned Description": "financial service representative solution seniorlevel professional position insurance industry sell life insurance business individual behalf insurance company sample task position include limited calling policyholder deliver explain policy suggest addition change calculating premium customizing insurance program suite individual customer seeking new client developing clientele networking ensuring policy requirement fulfilled conferring client obtain provide information calims made policy potential job title use solution life insurance sale professional insurance sale agent multiple configuration solution available",
        "cleaned_full_text": "Financial Services Representative Solution. financial service representative solution seniorlevel professional position insurance industry sell life insurance business individual behalf insurance company sample task position include limited calling policyholder deliver explain policy suggest addition change calculating premium customizing insurance program suite individual customer seeking new client developing clientele networking ensuring policy requirement fulfilled conferring client obtain provide information calims made policy potential job title use solution life insurance sale professional insurance sale agent multiple configuration solution available"
    },
    {
        "Assessment Name": "Front Desk Associate Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/front-desk-associate-solution/",
        "Description": "The Front Desk Associate solution is designed for entry-level customer service positions in the hospitality industry. The solution is appropriate for positions in which the majority of work is done at the front or guest check-in desk. Sample tasks may include: welcoming guests warmly, issuing keys to guests, tabulating guest bills and accpeting payment. Potential job titles that use this solution are: Front Desk Clerk, Guest Desk Attendant, Guest Check-in Associate, or Front Office Agent. Multiple configurations of this solution are available.",
        "Duration": "50",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "front desk associate solution designed entrylevel customer service position hospitality industry solution appropriate position majority work done front guest checkin desk sample task may include welcoming guest warmly issuing key guest tabulating guest bill accpeting payment potential job title use solution front desk clerk guest desk attendant guest checkin associate front office agent multiple configuration solution available",
        "cleaned_full_text": "Front Desk Associate Solution. front desk associate solution designed entrylevel customer service position hospitality industry solution appropriate position majority work done front guest checkin desk sample task may include welcoming guest warmly issuing key guest tabulating guest bill accpeting payment potential job title use solution front desk clerk guest desk attendant guest checkin associate front office agent multiple configuration solution available"
    },
    {
        "Assessment Name": "Gaming Associate Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/gaming-associate-solution/",
        "Description": "The Gaming Associate solution is designed for entry to mid-level positions operating gaming tables. The solution is for highly customer service focused positions that may potentially deal with large sums of money. Sample tasks may include: dealing playing cards, counting and confirming patron bets, collecting patron losses and distributing patron winnings, and exchange currency for playing chips. Potential job titles that use this solution are: Table Games Dealer, Black Jack Dealer, Dealer, Casino Dealer, Dual Rate Dealer, Card Dealer and Gaming Dealer. Multiple configurations of this solution are available.",
        "Duration": "50",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "gaming associate solution designed entry midlevel position operating gaming table solution highly customer service focused position may potentially deal large sum money sample task may include dealing playing card counting confirming patron bet collecting patron loss distributing patron winning exchange currency playing chip potential job title use solution table game dealer black jack dealer dealer casino dealer dual rate dealer card dealer gaming dealer multiple configuration solution available",
        "cleaned_full_text": "Gaming Associate Solution. gaming associate solution designed entry midlevel position operating gaming table solution highly customer service focused position may potentially deal large sum money sample task may include dealing playing card counting confirming patron bet collecting patron loss distributing patron winning exchange currency playing chip potential job title use solution table game dealer black jack dealer dealer casino dealer dual rate dealer card dealer gaming dealer multiple configuration solution available"
    },
    {
        "Assessment Name": "Gaming Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/gaming-manager-solution/",
        "Description": "The Gaming Manager solution is designed for management level positions within the hospitality industry. Sample tasks include managing operations, supervisors and associates within gaming environments. The solution is focused on security, integrity and managing sales. Potential job titles that use this solution are: Gaming Floor Manager and Gaming Manager. Multiple configurations of this solution are available.",
        "Duration": "55",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "S, A, B, K, P",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "gaming manager solution designed management level position within hospitality industry sample task include managing operation supervisor associate within gaming environment solution focused security integrity managing sale potential job title use solution gaming floor manager gaming manager multiple configuration solution available",
        "cleaned_full_text": "Gaming Manager Solution. gaming manager solution designed management level position within hospitality industry sample task include managing operation supervisor associate within gaming environment solution focused security integrity managing sale potential job title use solution gaming floor manager gaming manager multiple configuration solution available"
    },
    {
        "Assessment Name": "General Entry Level - All Industries 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/general-entry-level-all-industries-7-0-solution/",
        "Description": "Our General Entry Level – All Industries 7.0 solution is designed for entry-level positions across industries. This solution predicts the following types of behaviors foundational to all jobs: being on-time to work; following rules and policies; treating others respectfully; producing quality work; meeting goals; and effectively working alongside others.\n\nSolution can be used across all industries with entry-level positions. Example titles include, but are not limited to: Administrator, Clerk, Veterinary Assistant, Stocker, Dish Washer, Office Coordinator, Tour Guide, Cook, Assistant, Housekeeper, Waste Collector.",
        "Duration": "19",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "general entry level industry solution designed entrylevel position across industry solution predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal effectively working alongside others solution used across industry entrylevel position example title include limited administrator clerk veterinary assistant stocker dish washer office coordinator tour guide cook assistant housekeeper waste collector",
        "cleaned_full_text": "General Entry Level - All Industries 7.0 Solution. general entry level industry solution designed entrylevel position across industry solution predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal effectively working alongside others solution used across industry entrylevel position example title include limited administrator clerk veterinary assistant stocker dish washer office coordinator tour guide cook assistant housekeeper waste collector"
    },
    {
        "Assessment Name": "General Entry Level - All Industries 7.1 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/general-entry-level-all-industries-7-1-solution/",
        "Description": "Our General Entry Level – All Industries 7.1 solution is designed for entry-level positions across industries. This solution predicts the following types of behaviors foundational to all jobs: being on-time to work; following rules and policies; treating others respectfully; producing quality work; meeting goals; and effectively working alongside others.\n\nSolution can be used across all industries with entry-level positions. Example titles include, but are not limited to: Administrator, Clerk, Veterinary Assistant, Stocker, Dish Washer, Office Coordinator, Tour Guide, Cook, Assistant, Housekeeper, Waste Collector. “MCP Product: please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is Americas and International.\"",
        "Duration": "19",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "general entry level industry solution designed entrylevel position across industry solution predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal effectively working alongside others solution used across industry entrylevel position example title include limited administrator clerk veterinary assistant stocker dish washer office coordinator tour guide cook assistant housekeeper waste collector mcp product please note need select correct package depending norm intend use package available product america international",
        "cleaned_full_text": "General Entry Level - All Industries 7.1 Solution. general entry level industry solution designed entrylevel position across industry solution predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal effectively working alongside others solution used across industry entrylevel position example title include limited administrator clerk veterinary assistant stocker dish washer office coordinator tour guide cook assistant housekeeper waste collector mcp product please note need select correct package depending norm intend use package available product america international"
    },
    {
        "Assessment Name": "General Entry Level - All Industries 7.1(Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/general-entry-level-all-industries-7-1%28americas%29/",
        "Description": "Our General Entry Level – All Industries 7.1 solution is designed for entry-level positions across industries. This solution predicts the following types of behaviors foundational to all jobs: being on-time to work; following rules and policies; treating others respectfully; producing quality work; meeting goals; and effectively working alongside others.\n\nSolution can be used across all industries with entry-level positions. Example titles include, but are not limited to: Administrator, Clerk, Veterinary Assistant, Stocker, Dish Washer, Office Coordinator, Tour Guide, Cook, Assistant, Housekeeper, Waste Collector.",
        "Duration": "19",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "general entry level industry solution designed entrylevel position across industry solution predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal effectively working alongside others solution used across industry entrylevel position example title include limited administrator clerk veterinary assistant stocker dish washer office coordinator tour guide cook assistant housekeeper waste collector",
        "cleaned_full_text": "General Entry Level - All Industries 7.1(Americas). general entry level industry solution designed entrylevel position across industry solution predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal effectively working alongside others solution used across industry entrylevel position example title include limited administrator clerk veterinary assistant stocker dish washer office coordinator tour guide cook assistant housekeeper waste collector"
    },
    {
        "Assessment Name": "General Entry Level – Data Entry 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/general-entry-level-data-entry-7-0-solution/",
        "Description": "Our General Entry Level – Data Entry 7.0 solution is designed for entry-level positions that include entering data into computers or data management systems. This solution measures speed and accuracy at typing text and numbers into forms and predicts the following types of behaviors foundational to all jobs: being on-time to work; following rules and policies; treating others respectfully; producing quality work; meeting goals; and approaching work in a thorough and precise manner.  \n\nThis solution can be used across all industries with entry-level positions. Example titles include, but are not limited to: Accounting Clerk, Accounts Receivable Clerk, Administrative Clerk, Clerical Aide, Clerical Assistant, Office Assistant, Office Services Specialist, Staff Assistant.\nReport Language Availability: English (USA)",
        "Duration": "24",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, K",
        "Job Level": "General Population, Entry-Level,",
        "Cleaned Description": "general entry level data entry solution designed entrylevel position include entering data computer data management system solution measure speed accuracy typing text number form predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal approaching work thorough precise manner solution used across industry entrylevel position example title include limited accounting clerk account receivable clerk administrative clerk clerical aide clerical assistant office assistant office service specialist staff assistant report language availability english usa",
        "cleaned_full_text": "General Entry Level – Data Entry 7.0 Solution. general entry level data entry solution designed entrylevel position include entering data computer data management system solution measure speed accuracy typing text number form predicts following type behavior foundational job ontime work following rule policy treating others respectfully producing quality work meeting goal approaching work thorough precise manner solution used across industry entrylevel position example title include limited accounting clerk account receivable clerk administrative clerk clerical aide clerical assistant office assistant office service specialist staff assistant report language availability english usa"
    },
    {
        "Assessment Name": "Graduate + 8.0 Job Focused Assessment",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/graduate-8-0-job-focused-assessment/",
        "Description": "The Graduate + 8.0 Job Focused Assessment is a short, targeted, globally applicable assessment which includes a short cognitive ability measure. It helps you identify graduates with the highest potential to contribute and succeed, as well as providing actionable feedback to help you onboard new hires.\n\nIt is designed for professional level positions appropriate for recent college graduates and is available as part of SHL’s Graduate Solution.",
        "Duration": "minutes",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Graduate,",
        "Cleaned Description": "graduate job focused assessment short targeted globally applicable assessment includes short cognitive ability measure help identify graduate highest potential contribute succeed well providing actionable feedback help onboard new hire designed professional level position appropriate recent college graduate available part shls graduate solution",
        "cleaned_full_text": "Graduate + 8.0 Job Focused Assessment. graduate job focused assessment short targeted globally applicable assessment includes short cognitive ability measure help identify graduate highest potential contribute succeed well providing actionable feedback help onboard new hire designed professional level position appropriate recent college graduate available part shls graduate solution"
    },
    {
        "Assessment Name": "Graduate 7.1 Job Focused Assessment",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/graduate-7-1-job-focused-assessment/",
        "Description": "The Graduate 7.1 Job Focused Assessment is designed for professional level positions appropriate for recent college graduates.",
        "Duration": "19",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C",
        "Job Level": "Graduate,",
        "Cleaned Description": "graduate job focused assessment designed professional level position appropriate recent college graduate",
        "cleaned_full_text": "Graduate 7.1 Job Focused Assessment. graduate job focused assessment designed professional level position appropriate recent college graduate"
    },
    {
        "Assessment Name": "Graduate 8.0 Job Focused Assessment",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/graduate-8-0-job-focused-assessment-4228/",
        "Description": "The Graduate 8.0 Job Focused Assessment is a short, targeted, globally applicable assessment to help you identify graduates with the highest potential to contribute and succeed. It also provides actionable feedback to help you onboard new hires.\n\nIt is designed for professional level positions appropriate for recent college graduates and is available as part of SHL’s Graduate Solution.",
        "Duration": "minutes",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "P, B",
        "Job Level": "Graduate,",
        "Cleaned Description": "graduate job focused assessment short targeted globally applicable assessment help identify graduate highest potential contribute succeed also provides actionable feedback help onboard new hire designed professional level position appropriate recent college graduate available part shls graduate solution",
        "cleaned_full_text": "Graduate 8.0 Job Focused Assessment. graduate job focused assessment short targeted globally applicable assessment help identify graduate highest potential contribute succeed also provides actionable feedback help onboard new hire designed professional level position appropriate recent college graduate available part shls graduate solution"
    },
    {
        "Assessment Name": "Guest Service Team 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/guest-service-team-7-0-solution/",
        "Description": "Our Guest Service Team 7.0 solution is designed for team-oriented entry-level positions that involve a high degree of interaction with customers. The solution covers a wide variety of positions, and assesses competencies critical to interacting with customers including: persisting to meet guest needs; behaving responsibly and appropriately; effectively working alongside others; preparing and/or delivering customer orders; following rules and policies; and communicating effectively. \n\nPotential job titles that use this solution include: Server, Hostess, Guest Services Team Member, Customer Service Champion.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "18",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "guest service team solution designed teamoriented entrylevel position involve high degree interaction customer solution cover wide variety position assesses competency critical interacting customer including persisting meet guest need behaving responsibly appropriately effectively working alongside others preparing andor delivering customer order following rule policy communicating effectively potential job title use solution include server hostess guest service team member customer service champion report language availability english usa latin american spanish",
        "cleaned_full_text": "Guest Service Team 7.0 Solution. guest service team solution designed teamoriented entrylevel position involve high degree interaction customer solution cover wide variety position assesses competency critical interacting customer including persisting meet guest need behaving responsibly appropriately effectively working alongside others preparing andor delivering customer order following rule policy communicating effectively potential job title use solution include server hostess guest service team member customer service champion report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Guest Services Associate Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/guest-services-associate-solution/",
        "Description": "The Guest Services Associate solution is designed for entry to mid-level customer service positions in the hospitality industry. The solution is for highly customer service focused positions with few to no sales components. Sample tasks may include: providing information on entertainment, dining and transportation to guests, making dining recommentations to guests, arranging transportation for guests, and making reservations. Potential job titles that use this solution are: Concierge, Guest Services Agent, Club Concierge, Hotel Concierge, Front Office Manager and Guest Services Associate. Multiple configurations of this solution are available.",
        "Duration": "48",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "guest service associate solution designed entry midlevel customer service position hospitality industry solution highly customer service focused position sale component sample task may include providing information entertainment dining transportation guest making dining recommentations guest arranging transportation guest making reservation potential job title use solution concierge guest service agent club concierge hotel concierge front office manager guest service associate multiple configuration solution available",
        "cleaned_full_text": "Guest Services Associate Solution. guest service associate solution designed entry midlevel customer service position hospitality industry solution highly customer service focused position sale component sample task may include providing information entertainment dining transportation guest making dining recommentations guest arranging transportation guest making reservation potential job title use solution concierge guest service agent club concierge hotel concierge front office manager guest service associate multiple configuration solution available"
    },
    {
        "Assessment Name": "Healthcare Aide 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/healthcare-aide-7-0-solution/",
        "Description": "Our Healthcare Aide 7.0 solution is designed for individually-oriented, entry-level positions that directly support another person's health and well-being. The solution covers a wide variety of positions, and assesses behaviors critical for patient support roles including: understanding and following detailed instructions; administering personal care; being respectful and tolerant of patients; preparing and maintaining records of patient progress and services performed; and working hard to meet or exceed patient needs.  \nPotential job titles that use this solution include: Personal Care Aide, Healthcare Aide, Home Health Aide, Dental Assistant.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "22",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "healthcare aide solution designed individuallyoriented entrylevel position directly support another person health wellbeing solution cover wide variety position assesses behavior critical patient support role including understanding following detailed instruction administering personal care respectful tolerant patient preparing maintaining record patient progress service performed working hard meet exceed patient need potential job title use solution include personal care aide healthcare aide home health aide dental assistant report language availability english usa latin american spanish",
        "cleaned_full_text": "Healthcare Aide 7.0 Solution. healthcare aide solution designed individuallyoriented entrylevel position directly support another person health wellbeing solution cover wide variety position assesses behavior critical patient support role including understanding following detailed instruction administering personal care respectful tolerant patient preparing maintaining record patient progress service performed working hard meet exceed patient need potential job title use solution include personal care aide healthcare aide home health aide dental assistant report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Healthcare Call Center Agent Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/healthcare-call-center-agent-solution/",
        "Description": "The Healthcare Call Center Agent solution is for entry-level positions in an inbound healthcare call center environment.  Sample tasks for this job include, but are not limited to: taking and receiving information from patients over the phone, working between computer screens, and entering information into a computer.  Potential job titles that use this solution are: Call Center Representative, Receptionist, and Switchboard Operator.  Multiple configurations of this solution are available.",
        "Duration": "44",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "healthcare call center agent solution entrylevel position inbound healthcare call center environment sample task job include limited taking receiving information patient phone working computer screen entering information computer potential job title use solution call center representative receptionist switchboard operator multiple configuration solution available",
        "cleaned_full_text": "Healthcare Call Center Agent Solution. healthcare call center agent solution entrylevel position inbound healthcare call center environment sample task job include limited taking receiving information patient phone working computer screen entering information computer potential job title use solution call center representative receptionist switchboard operator multiple configuration solution available"
    },
    {
        "Assessment Name": "Healthcare Service Associate Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/healthcare-service-associate-solution/",
        "Description": "The Healthcare Service Associate solution is for entry-level positions in a healthcare environment that require the employee to interact with patients.  Sample tasks for this job include, but are not limited to: delivering food to patients, cleaning patient rooms, and welcoming guests to the hospital.  Potential job titles that use this solution are: Housekeepers, Dietary Aides, and Guest Services Coordinator. There are multiple configurations and versions of this solution available.",
        "Duration": "37",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "healthcare service associate solution entrylevel position healthcare environment require employee interact patient sample task job include limited delivering food patient cleaning patient room welcoming guest hospital potential job title use solution housekeeper dietary aide guest service coordinator multiple configuration version solution available",
        "cleaned_full_text": "Healthcare Service Associate Solution. healthcare service associate solution entrylevel position healthcare environment require employee interact patient sample task job include limited delivering food patient cleaning patient room welcoming guest hospital potential job title use solution housekeeper dietary aide guest service coordinator multiple configuration version solution available"
    },
    {
        "Assessment Name": "Healthcare Support Specialist Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/healthcare-support-specialist-solution/",
        "Description": "The Healthcare Support Specialist solution is for entry-level positions in a healthcare environment that do not require the employee to interact with patients.  Sample tasks for this job include, but are not limited to: preparing food for patients, washing hospital linens, and cleaning the healthcare facility.  Potential job titles that use this solution are: Janitors, Food Preparation Workers, and Laundry Associates.  Multiple configurations of this solution are available.",
        "Duration": "30",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "healthcare support specialist solution entrylevel position healthcare environment require employee interact patient sample task job include limited preparing food patient washing hospital linen cleaning healthcare facility potential job title use solution janitor food preparation worker laundry associate multiple configuration solution available",
        "cleaned_full_text": "Healthcare Support Specialist Solution. healthcare support specialist solution entrylevel position healthcare environment require employee interact patient sample task job include limited preparing food patient washing hospital linen cleaning healthcare facility potential job title use solution janitor food preparation worker laundry associate multiple configuration solution available"
    },
    {
        "Assessment Name": "Home Health Aide Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/home-health-aide-solution/",
        "Description": "The Home Health Aide solution is for entry-level positions in an in-home or group home environment.  Sample tasks for this job include, but are not limited to: monitoring vital signs and medication intake, administering bedside and personal care such as ambulation and personal hygiene, and preparing and maintaining records of patient progress and services performed.  Potential job titles that use this solution are: Personal Care Aide, Home Health Aide, Residential Assistant, and Certified Nursing Assistant. There are multiple configurations and versions of this solution available.",
        "Duration": "41",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "home health aide solution entrylevel position inhome group home environment sample task job include limited monitoring vital sign medication intake administering bedside personal care ambulation personal hygiene preparing maintaining record patient progress service performed potential job title use solution personal care aide home health aide residential assistant certified nursing assistant multiple configuration version solution available",
        "cleaned_full_text": "Home Health Aide Solution. home health aide solution entrylevel position inhome group home environment sample task job include limited monitoring vital sign medication intake administering bedside personal care ambulation personal hygiene preparing maintaining record patient progress service performed potential job title use solution personal care aide home health aide residential assistant certified nursing assistant multiple configuration version solution available"
    },
    {
        "Assessment Name": "Hospitality Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/hospitality-manager-solution/",
        "Description": "The Hospitality Manager solution is designed for management level positions in the hospitality industry. Sample tasks include overall property management, managing staff and managing the guest experience. The solution is focused on managing business operations, managing staff, solving problems, making good decisions and maintaining focus on the customer. Potential job titles that use this solution are: Property Manager, Property Director, Hotel Manager and Hospitality Manager. Multiple configurations of this solution are available.",
        "Duration": "57",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, K, P",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "hospitality manager solution designed management level position hospitality industry sample task include overall property management managing staff managing guest experience solution focused managing business operation managing staff solving problem making good decision maintaining focus customer potential job title use solution property manager property director hotel manager hospitality manager multiple configuration solution available",
        "cleaned_full_text": "Hospitality Manager Solution. hospitality manager solution designed management level position hospitality industry sample task include overall property management managing staff managing guest experience solution focused managing business operation managing staff solving problem making good decision maintaining focus customer potential job title use solution property manager property director hotel manager hospitality manager multiple configuration solution available"
    },
    {
        "Assessment Name": "Host Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/host-solution/",
        "Description": "The Host solution is designed for entry level positions in the hospitality industry. Sample tasks include greeting guests, managing wait lists and showing guests to their tables. The solution is focused on work ethic and customer focus. Potential job titles that use this solution are: Host, Hostess and Greeter. There are multiple configurations and versions of this solution available.",
        "Duration": "30",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "host solution designed entry level position hospitality industry sample task include greeting guest managing wait list showing guest table solution focused work ethic customer focus potential job title use solution host hostess greeter multiple configuration version solution available",
        "cleaned_full_text": "Host Solution. host solution designed entry level position hospitality industry sample task include greeting guest managing wait list showing guest table solution focused work ethic customer focus potential job title use solution host hostess greeter multiple configuration version solution available"
    },
    {
        "Assessment Name": "Industrial - Entry Level 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-entry-level-7-0-solution/",
        "Description": "Our Industrial – Entry Level 7.0 solution is designed for entry-level positions, and measures the behaviors and experiences that underlie successful and safe performance in general or light industrial roles. The solution covers a wide variety of entry-level positions, and assesses behaviors including: following policies and procedures; general facility upkeep; producing high quality work; maintaining an orderly work environment; wearing required protective equipment; and being thorough.\nPotential job titles that use this solution include: Laborer, Custodians, Building and Grounds Maintenance Workers, Handyman.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial entry level solution designed entrylevel position measure behavior experience underlie successful safe performance general light industrial role solution cover wide variety entrylevel position assesses behavior including following policy procedure general facility upkeep producing high quality work maintaining orderly work environment wearing required protective equipment thorough potential job title use solution include laborer custodian building ground maintenance worker handyman report language availability english usa latin american spanish",
        "cleaned_full_text": "Industrial - Entry Level 7.0 Solution. industrial entry level solution designed entrylevel position measure behavior experience underlie successful safe performance general light industrial role solution cover wide variety entrylevel position assesses behavior including following policy procedure general facility upkeep producing high quality work maintaining orderly work environment wearing required protective equipment thorough potential job title use solution include laborer custodian building ground maintenance worker handyman report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Industrial - Entry Level 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-entry-level-7-1-%28americas%29/",
        "Description": "Our Industrial – Entry Level 7.1 solution is designed for entry-level positions, and measures the behaviors and experiences that underlie successful and safe performance in general or light industrial roles. The solution covers a wide variety of entry-level positions, and assesses behaviors including: following policies and procedures; general facility upkeep; producing high quality work; maintaining an orderly work environment; wearing required protective equipment; and being thorough.\nPotential job titles that use this solution include: Laborer, Custodians, Building and Grounds Maintenance Workers, Handyman.\n“IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International and Americas\".",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial entry level solution designed entrylevel position measure behavior experience underlie successful safe performance general light industrial role solution cover wide variety entrylevel position assesses behavior including following policy procedure general facility upkeep producing high quality work maintaining orderly work environment wearing required protective equipment thorough potential job title use solution include laborer custodian building ground maintenance worker handyman important please note need select correct package depending norm intend use package available product international america",
        "cleaned_full_text": "Industrial - Entry Level 7.1 (Americas). industrial entry level solution designed entrylevel position measure behavior experience underlie successful safe performance general light industrial role solution cover wide variety entrylevel position assesses behavior including following policy procedure general facility upkeep producing high quality work maintaining orderly work environment wearing required protective equipment thorough potential job title use solution include laborer custodian building ground maintenance worker handyman important please note need select correct package depending norm intend use package available product international america"
    },
    {
        "Assessment Name": "Industrial - Entry Level 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-entry-level-7-1-%28international%29/",
        "Description": "Our Industrial – Entry Level 7.1 solution is designed for entry-level positions, and measures the behaviors and experiences that underlie successful and safe performance in general or light industrial roles. The solution covers a wide variety of entry-level positions, and assesses behaviors including: following policies and procedures; general facility upkeep; producing high quality work; maintaining an orderly work environment; wearing required protective equipment; and being thorough.\nPotential job titles that use this solution include: Laborer, Custodians, Building and Grounds Maintenance Workers, Handyman.\n“IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International and Americas\".",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial entry level solution designed entrylevel position measure behavior experience underlie successful safe performance general light industrial role solution cover wide variety entrylevel position assesses behavior including following policy procedure general facility upkeep producing high quality work maintaining orderly work environment wearing required protective equipment thorough potential job title use solution include laborer custodian building ground maintenance worker handyman important please note need select correct package depending norm intend use package available product international america",
        "cleaned_full_text": "Industrial - Entry Level 7.1 (International). industrial entry level solution designed entrylevel position measure behavior experience underlie successful safe performance general light industrial role solution cover wide variety entrylevel position assesses behavior including following policy procedure general facility upkeep producing high quality work maintaining orderly work environment wearing required protective equipment thorough potential job title use solution include laborer custodian building ground maintenance worker handyman important please note need select correct package depending norm intend use package available product international america"
    },
    {
        "Assessment Name": "Industrial - Professional and Skilled 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-professional-and-skilled-7-0-solution/",
        "Description": "Our Industrial – Professional and Skilled 7.0 solution is designed to measure the behaviors and experiences that underlie successful and safe performance in the workplace for specialized technical or professional industrial roles. \nThis solution assesses mechanical comprehension and other foundational behaviors including: behaving safely and efficiently in the workplace; installing, repairing, and/or maintaining equipment and machinery; making sound mechanical decisions; maintaining an orderly work environment; and producing high quality and reliable work.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial professional skilled solution designed measure behavior experience underlie successful safe performance workplace specialized technical professional industrial role solution assesses mechanical comprehension foundational behavior including behaving safely efficiently workplace installing repairing andor maintaining equipment machinery making sound mechanical decision maintaining orderly work environment producing high quality reliable work report language availability english usa latin american spanish",
        "cleaned_full_text": "Industrial - Professional and Skilled 7.0 Solution. industrial professional skilled solution designed measure behavior experience underlie successful safe performance workplace specialized technical professional industrial role solution assesses mechanical comprehension foundational behavior including behaving safely efficiently workplace installing repairing andor maintaining equipment machinery making sound mechanical decision maintaining orderly work environment producing high quality reliable work report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Industrial - Semi-skilled 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-semi-skilled-7-1-%28americas%29/",
        "Description": "Our Industrial – Semi-skilled 7.1 solution is designed for entry-level positions and measures the behaviors and experiences that underlie successful and safe performance for production workers. The solution assesses behaviors and competencies foundational to industrial roles including: following policies and procedures; applying relevant trade skills; wearing required protective equipment; working with or monitoring equipment; producing high quality work; effectively working with others; and maintaining an orderly work environment. \nPotential job titles that use this solution include: Production and Assembly Worker, Construction Worker, Extraction Technician.Please note this package is in Americas norm.",
        "Duration": "24",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial semiskilled solution designed entrylevel position measure behavior experience underlie successful safe performance production worker solution assesses behavior competency foundational industrial role including following policy procedure applying relevant trade skill wearing required protective equipment working monitoring equipment producing high quality work effectively working others maintaining orderly work environment potential job title use solution include production assembly worker construction worker extraction technicianplease note package america norm",
        "cleaned_full_text": "Industrial - Semi-skilled 7.1 (Americas). industrial semiskilled solution designed entrylevel position measure behavior experience underlie successful safe performance production worker solution assesses behavior competency foundational industrial role including following policy procedure applying relevant trade skill wearing required protective equipment working monitoring equipment producing high quality work effectively working others maintaining orderly work environment potential job title use solution include production assembly worker construction worker extraction technicianplease note package america norm"
    },
    {
        "Assessment Name": "Industrial - Semi-skilled 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-semi-skilled-7-1-%28international%29/",
        "Description": "Our Industrial – Semi-skilled 7.1 solution is designed for entry-level positions and measures the behaviors and experiences that underlie successful and safe performance for production workers. The solution assesses behaviors and competencies foundational to industrial roles including: following policies and procedures; applying relevant trade skills; wearing required protective equipment; working with or monitoring equipment; producing high quality work; effectively working with others; and maintaining an orderly work environment. \nPotential job titles that use this solution include: Production and Assembly Worker, Construction Worker, Extraction Technician.Please note this package is in International norm.",
        "Duration": "24",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial semiskilled solution designed entrylevel position measure behavior experience underlie successful safe performance production worker solution assesses behavior competency foundational industrial role including following policy procedure applying relevant trade skill wearing required protective equipment working monitoring equipment producing high quality work effectively working others maintaining orderly work environment potential job title use solution include production assembly worker construction worker extraction technicianplease note package international norm",
        "cleaned_full_text": "Industrial - Semi-skilled 7.1 (International). industrial semiskilled solution designed entrylevel position measure behavior experience underlie successful safe performance production worker solution assesses behavior competency foundational industrial role including following policy procedure applying relevant trade skill wearing required protective equipment working monitoring equipment producing high quality work effectively working others maintaining orderly work environment potential job title use solution include production assembly worker construction worker extraction technicianplease note package international norm"
    },
    {
        "Assessment Name": "Industrial Professional and Skilled 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-professional-and-skilled-7-1-%28americas%29/",
        "Description": "Our Industrial – Professional and Skilled 7.1 solution is designed to measure the behaviors and experiences that underlie successful and safe performance in the workplace for specialized technical or professional industrial roles. \nThis solution assesses mechanical comprehension and other foundational behaviors including: behaving safely and efficiently in the workplace; installing, repairing, and/or maintaining equipment and machinery; making sound mechanical decisions; maintaining an orderly work environment; and producing high quality and reliable work.“IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International and Americas\".",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial professional skilled solution designed measure behavior experience underlie successful safe performance workplace specialized technical professional industrial role solution assesses mechanical comprehension foundational behavior including behaving safely efficiently workplace installing repairing andor maintaining equipment machinery making sound mechanical decision maintaining orderly work environment producing high quality reliable workimportant please note need select correct package depending norm intend use package available product international america",
        "cleaned_full_text": "Industrial Professional and Skilled 7.1 (Americas). industrial professional skilled solution designed measure behavior experience underlie successful safe performance workplace specialized technical professional industrial role solution assesses mechanical comprehension foundational behavior including behaving safely efficiently workplace installing repairing andor maintaining equipment machinery making sound mechanical decision maintaining orderly work environment producing high quality reliable workimportant please note need select correct package depending norm intend use package available product international america"
    },
    {
        "Assessment Name": "Industrial Professional and Skilled 7.1 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/industrial-professional-and-skilled-7-1-solution/",
        "Description": "Our Industrial – Professional and Skilled 7.1 solution is designed to measure the behaviors and experiences that underlie successful and safe performance in the workplace for specialized technical or professional industrial roles. \nThis solution assesses mechanical comprehension and other foundational behaviors including: behaving safely and efficiently in the workplace; installing, repairing, and/or maintaining equipment and machinery; making sound mechanical decisions; maintaining an orderly work environment; and producing high quality and reliable work.“IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International and Americas\".",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "industrial professional skilled solution designed measure behavior experience underlie successful safe performance workplace specialized technical professional industrial role solution assesses mechanical comprehension foundational behavior including behaving safely efficiently workplace installing repairing andor maintaining equipment machinery making sound mechanical decision maintaining orderly work environment producing high quality reliable workimportant please note need select correct package depending norm intend use package available product international america",
        "cleaned_full_text": "Industrial Professional and Skilled 7.1 Solution. industrial professional skilled solution designed measure behavior experience underlie successful safe performance workplace specialized technical professional industrial role solution assesses mechanical comprehension foundational behavior including behaving safely efficiently workplace installing repairing andor maintaining equipment machinery making sound mechanical decision maintaining orderly work environment producing high quality reliable workimportant please note need select correct package depending norm intend use package available product international america"
    },
    {
        "Assessment Name": "Installation and Repair Technician Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/installation-and-repair-technician-solution/",
        "Description": "The Installation and Repair Technician solution is designed for use with entry-level field technician positions in the telecommunications industry. The solution is focused on positions that involve installing, repairing, and maintaining telecommunications equipment, along with some customer interaction, and little to no specific sales components. Sample tasks may include: installing or repairing end-user telecommunications equipment and services, interacting with customers, and installing, or repairing telecommunications network infrastructure. Potential job titles that use this solution are: Installer, Service Technician, and Customer Installation Technician. There are multiple configurations of this solution available.",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Professional Individual Contributor,",
        "Cleaned Description": "installation repair technician solution designed use entrylevel field technician position telecommunication industry solution focused position involve installing repairing maintaining telecommunication equipment along customer interaction little specific sale component sample task may include installing repairing enduser telecommunication equipment service interacting customer installing repairing telecommunication network infrastructure potential job title use solution installer service technician customer installation technician multiple configuration solution available",
        "cleaned_full_text": "Installation and Repair Technician Solution. installation repair technician solution designed use entrylevel field technician position telecommunication industry solution focused position involve installing repairing maintaining telecommunication equipment along customer interaction little specific sale component sample task may include installing repairing enduser telecommunication equipment service interacting customer installing repairing telecommunication network infrastructure potential job title use solution installer service technician customer installation technician multiple configuration solution available"
    },
    {
        "Assessment Name": "Insurance Account Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/insurance-account-manager-solution/",
        "Description": "The Insurance Account Manager solution is for mid-level insurance professionals that manage the day-to-day operations and activities of customer accounts.  Sample tasks for this job include, but are not limited to: soliciting sales of new or additional products or services; interacting with customers to provide information in response to inquiries about products and services and to handle and resolve complaints; keeping records of customer interactions and transactions; resolving customers' service or billing complaints; determining charges for services requested; collecting deposits or payments; and arranging for billing.  Potential job titles that use this solution are: Account Executive, Account Manager, and Senior Account Manager.  Multiple configurations of this solution are available.",
        "Duration": "48",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Mid-Professional,",
        "Cleaned Description": "insurance account manager solution midlevel insurance professional manage daytoday operation activity customer account sample task job include limited soliciting sale new additional product service interacting customer provide information response inquiry product service handle resolve complaint keeping record customer interaction transaction resolving customer service billing complaint determining charge service requested collecting deposit payment arranging billing potential job title use solution account executive account manager senior account manager multiple configuration solution available",
        "cleaned_full_text": "Insurance Account Manager Solution. insurance account manager solution midlevel insurance professional manage daytoday operation activity customer account sample task job include limited soliciting sale new additional product service interacting customer provide information response inquiry product service handle resolve complaint keeping record customer interaction transaction resolving customer service billing complaint determining charge service requested collecting deposit payment arranging billing potential job title use solution account executive account manager senior account manager multiple configuration solution available"
    },
    {
        "Assessment Name": "Insurance Administrative Assistant Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/insurance-administrative-assistant-solution/",
        "Description": "The Administrative Assistant solution is for entry-level clerical positions that interact with external or internal customers. Sample tasks for this job include, but are not limited to: answering telephones; managing files and records; sorting mail; handling information requests; greeting customers; and collaborating with co-workers on projects. Potential job titles that use this solution are: Receptionist and Administrative Assistant. Multiple configurations of this solution are available.",
        "Duration": "24",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "administrative assistant solution entrylevel clerical position interact external internal customer sample task job include limited answering telephone managing file record sorting mail handling information request greeting customer collaborating coworkers project potential job title use solution receptionist administrative assistant multiple configuration solution available",
        "cleaned_full_text": "Insurance Administrative Assistant Solution. administrative assistant solution entrylevel clerical position interact external internal customer sample task job include limited answering telephone managing file record sorting mail handling information request greeting customer collaborating coworkers project potential job title use solution receptionist administrative assistant multiple configuration solution available"
    },
    {
        "Assessment Name": "Insurance Agent Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/insurance-agent-solution/",
        "Description": "The Insurance Agent solution is for mid-level professional positions in the insurance industry that sell property, casualty, automotive, or other types of insurance. Sample tasks for this position include, but are not limited to: calling on policyholders to deliver and explain policies or suggest additions or changes; calculating premiums; customizing insurance programs to suit individual customers; ensuring policy requirements are fulfilled; and conferring with clients to obtain and provide information when claims are made on a policy. Potential job titles that use this solution are: Insurance Sales Professional; Insurance Sales Agent; Producer; Insurance Agent. Multiple configurations of this solution are available.",
        "Duration": "46",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Mid-Professional,",
        "Cleaned Description": "insurance agent solution midlevel professional position insurance industry sell property casualty automotive type insurance sample task position include limited calling policyholder deliver explain policy suggest addition change calculating premium customizing insurance program suit individual customer ensuring policy requirement fulfilled conferring client obtain provide information claim made policy potential job title use solution insurance sale professional insurance sale agent producer insurance agent multiple configuration solution available",
        "cleaned_full_text": "Insurance Agent Solution. insurance agent solution midlevel professional position insurance industry sell property casualty automotive type insurance sample task position include limited calling policyholder deliver explain policy suggest addition change calculating premium customizing insurance program suit individual customer ensuring policy requirement fulfilled conferring client obtain provide information claim made policy potential job title use solution insurance sale professional insurance sale agent producer insurance agent multiple configuration solution available"
    },
    {
        "Assessment Name": "Insurance Director Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/insurance-director-solution/",
        "Description": "The Insurance Director solution is for senior-level management positions in the insurance companies that oversee sales functions across multiple brokerages, offices, or agencies or geographic territories. Sample tasks for this job includes, but is not limited to: directing a group of sales managers or agency managers; having profit and loss responsibility for a district or region; and aligning work with overall company goals. Potential job titles that use this solution are: Regional Managers, Associate Directors, and Managing Directors. Multiple configurations of this solution are available.",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Director, Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "insurance director solution seniorlevel management position insurance company oversee sale function across multiple brokerage office agency geographic territory sample task job includes limited directing group sale manager agency manager profit loss responsibility district region aligning work overall company goal potential job title use solution regional manager associate director managing director multiple configuration solution available",
        "cleaned_full_text": "Insurance Director Solution. insurance director solution seniorlevel management position insurance company oversee sale function across multiple brokerage office agency geographic territory sample task job includes limited directing group sale manager agency manager profit loss responsibility district region aligning work overall company goal potential job title use solution regional manager associate director managing director multiple configuration solution available"
    },
    {
        "Assessment Name": "Insurance Sales Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/insurance-sales-manager-solution/",
        "Description": "The Sales Manager solution is for entry- to mid-level management positions that involve supervising employees working in an insurance organization and have a substantial portion of their job performance based on sales. Sample tasks for this job include, but are not limited to: planning and preparing work schedules; promoting products to customers; training subordinates; analyzing sales statistics gathered by staff to determine sales potential and monitor preferences of customers; building ongoing customer relationships; and making day-to-day decisions with minimal guidance from others. Potential job titles that use this solution are: Insurance Sales Manager, Sales Manager, Assistant Sales Manager, and Sales Supervisor. Multiple configurations of this solution are available.",
        "Duration": "51",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "sale manager solution entry midlevel management position involve supervising employee working insurance organization substantial portion job performance based sale sample task job include limited planning preparing work schedule promoting product customer training subordinate analyzing sale statistic gathered staff determine sale potential monitor preference customer building ongoing customer relationship making daytoday decision minimal guidance others potential job title use solution insurance sale manager sale manager assistant sale manager sale supervisor multiple configuration solution available",
        "cleaned_full_text": "Insurance Sales Manager Solution. sale manager solution entry midlevel management position involve supervising employee working insurance organization substantial portion job performance based sale sample task job include limited planning preparing work schedule promoting product customer training subordinate analyzing sale statistic gathered staff determine sale potential monitor preference customer building ongoing customer relationship making daytoday decision minimal guidance others potential job title use solution insurance sale manager sale manager assistant sale manager sale supervisor multiple configuration solution available"
    },
    {
        "Assessment Name": "Manager - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-short-form/",
        "Description": "The Manager solution is an assessment used for job candidates applying to entry-level leadership positions who tend to supervise salaried employees. Sample tasks for these jobs include, but are not limited to: planning projects with subordinates; collaborating with senior managers on developing new methods and procedures; coaching employees on performance-related issues; developing employees' skills; coordinating activities with other managers to accomplish organizational goals; setting and meeting department goals; prioritizing multiple tasks and priorities; making selected strategic and day-to-day decisions; and solving employees' and customers' problems. Potential job titles that use this solution are: Manager, Store Manager, and Branch Manager.",
        "Duration": "57",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, K, P, S",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "manager solution assessment used job candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem potential job title use solution manager store manager branch manager",
        "cleaned_full_text": "Manager - Short Form. manager solution assessment used job candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem potential job title use solution manager store manager branch manager"
    },
    {
        "Assessment Name": "Manager + 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-7-0-solution-3955/",
        "Description": "Our Manager + 7.0 solution is designed for candidates applying to entry-level leadership positions who tend to supervise salaried employees, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: planning projects with subordinates; collaborating with senior managers on developing new methods and procedures; coaching employees on performance-related issues; developing employees ' skills; coordinating activities with other managers to accomplish organizational goals; setting and meeting department goals; prioritizing multiple tasks and priorities; making selected strategic and day-to-day decisions; and solving employees' and customers' problems.\nReport Language Availability: English (USA).",
        "Duration": "53",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, C",
        "Job Level": "Front Line Manager, Manager,",
        "Cleaned Description": "manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa",
        "cleaned_full_text": "Manager + 7.0 Solution. manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa"
    },
    {
        "Assessment Name": "Manager + 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-7-1-solution-4242/",
        "Description": "Our Manager + 7.1 solution is designed for candidates applying to entry-level leadership positions who tend to supervise salaried employees, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: planning projects with subordinates; collaborating with senior managers on developing new methods and procedures; coaching employees on performance-related issues; developing employees ' skills; coordinating activities with other managers to accomplish organizational goals; setting and meeting department goals; prioritizing multiple tasks and priorities; making selected strategic and day-to-day decisions; and solving employees' and customers' problems.\nReport Language Availability: English (USA), Canadian French. “IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is Americas and International\".",
        "Duration": "63",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, C, P",
        "Job Level": "Director, Executive, Front Line Manager, Manager,",
        "Cleaned Description": "manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa canadian french important please note need select correct package depending norm intend use package available product america international",
        "cleaned_full_text": "Manager + 7.1 (Americas). manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa canadian french important please note need select correct package depending norm intend use package available product america international"
    },
    {
        "Assessment Name": "Manager + 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-7-1-%28international%29/",
        "Description": "Our Manager + 7.1 solution is designed for candidates applying to entry-level leadership positions who tend to supervise salaried employees, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: planning projects with subordinates; collaborating with senior managers on developing new methods and procedures; coaching employees on performance-related issues; developing employees ' skills; coordinating activities with other managers to accomplish organizational goals; setting and meeting department goals; prioritizing multiple tasks and priorities; making selected strategic and day-to-day decisions; and solving employees' and customers' problems.\nReport Language Availability: English (USA), Canadian French, Brazilian Portuguese, Danish, Dutch, Finnish, Italian, Norwegian, Swedish. “IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is Americas and International\".",
        "Duration": "63",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, C, P",
        "Job Level": "Director, Executive, Front Line Manager, Manager,",
        "Cleaned Description": "manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa canadian french brazilian portuguese danish dutch finnish italian norwegian swedish important please note need select correct package depending norm intend use package available product america international",
        "cleaned_full_text": "Manager + 7.1 (International). manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa canadian french brazilian portuguese danish dutch finnish italian norwegian swedish important please note need select correct package depending norm intend use package available product america international"
    },
    {
        "Assessment Name": "Manager 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-7-0-solution/",
        "Description": "Our Manager 7.0 solution is designed for candidates applying to entry-level leadership positions who tend to supervise salaried employees. Sample tasks for these jobs include, but are not limited to: planning projects with subordinates; collaborating with senior managers on developing new methods and procedures; coaching employees on performance-related issues; developing employees ' skills; coordinating activities with other managers to accomplish organizational goals; setting and meeting department goals; prioritizing multiple tasks and priorities; making selected strategic and day-to-day decisions; and solving employees' and customers' problems.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "35",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C",
        "Job Level": "Manager, Front Line Manager,",
        "Cleaned Description": "manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa latin american spanish",
        "cleaned_full_text": "Manager 7.0 Solution. manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problem report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Manager 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-7-1-%28americas%29/",
        "Description": "Our Manager 7.1 solution is designed for candidates applying to entry-level leadership positions who tend to supervise salaried employees. Sample tasks for these jobs include, but are not limited to: planning projects with subordinates; collaborating with senior managers on developing new methods and procedures; coaching employees on performance-related issues; developing employees ' skills; coordinating activities with other managers to accomplish organizational goals; setting and meeting department goals; prioritizing multiple tasks and priorities; making selected strategic and day-to-day decisions; and solving employees' and customers' problems.Report Language Availability: English (USA), Danish, Finnish, Canadian French, Italian, Norwegian, French, German, English International,.  “IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International\".",
        "Duration": "40",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C, P",
        "Job Level": "Executive, Director, Front Line Manager, Manager,",
        "Cleaned Description": "manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problemsreport language availability english usa danish finnish canadian french italian norwegian french german english international important please note need select correct package depending norm intend use package available product international",
        "cleaned_full_text": "Manager 7.1 (Americas). manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problemsreport language availability english usa danish finnish canadian french italian norwegian french german english international important please note need select correct package depending norm intend use package available product international"
    },
    {
        "Assessment Name": "Manager 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-7-1-solution/",
        "Description": "Our Manager 7.1 solution is designed for candidates applying to entry-level leadership positions who tend to supervise salaried employees. Sample tasks for these jobs include, but are not limited to: planning projects with subordinates; collaborating with senior managers on developing new methods and procedures; coaching employees on performance-related issues; developing employees ' skills; coordinating activities with other managers to accomplish organizational goals; setting and meeting department goals; prioritizing multiple tasks and priorities; making selected strategic and day-to-day decisions; and solving employees' and customers' problems.Report Language Availability: English (USA), Danish, Finnish, Canadian French, Italian, Norwegian, French, German, English International,.  “IMPORTANT! Please note that you will need to select the correct package depending on which norm you intend to use. The package available for this product is International\".",
        "Duration": "40",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C, P",
        "Job Level": "Director, Executive, Front Line Manager, Manager,",
        "Cleaned Description": "manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problemsreport language availability english usa danish finnish canadian french italian norwegian french german english international important please note need select correct package depending norm intend use package available product international",
        "cleaned_full_text": "Manager 7.1 (International). manager solution designed candidate applying entrylevel leadership position tend supervise salaried employee sample task job include limited planning project subordinate collaborating senior manager developing new method procedure coaching employee performancerelated issue developing employee skill coordinating activity manager accomplish organizational goal setting meeting department goal prioritizing multiple task priority making selected strategic daytoday decision solving employee customer problemsreport language availability english usa danish finnish canadian french italian norwegian french german english international important please note need select correct package depending norm intend use package available product international"
    },
    {
        "Assessment Name": "Manager 8.0 JFA",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-8-0-jfa/",
        "Description": "The Manager 8.0 Job-Focused Assessment is designed for candidates applying to their first leadership positions. It measures behaviors that underlie successful performance in first-line manager roles across a wide range of industries. It is most relevant to positions that supervise salaried employees. This JFA includes the Reskilling Potential Scale and the Management Potential Scale. •The Reskilling Potential scale measures tendency to learn from experiences in a way that supports professional success. •The Management Potential scale measures the potential for managerial success across industry type and functional area.",
        "Duration": "26",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, K, P",
        "Job Level": "Manager,",
        "Cleaned Description": "manager jobfocused assessment designed candidate applying first leadership position measure behavior underlie successful performance firstline manager role across wide range industry relevant position supervise salaried employee jfa includes reskilling potential scale management potential scale reskilling potential scale measure tendency learn experience way support professional success management potential scale measure potential managerial success across industry type functional area",
        "cleaned_full_text": "Manager 8.0 JFA. manager jobfocused assessment designed candidate applying first leadership position measure behavior underlie successful performance firstline manager role across wide range industry relevant position supervise salaried employee jfa includes reskilling potential scale management potential scale reskilling potential scale measure tendency learn experience way support professional success management potential scale measure potential managerial success across industry type functional area"
    },
    {
        "Assessment Name": "Manager 8.0+ JFA",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manager-8-0-jfa-4310/",
        "Description": "The Manager 8.0+ Job-Focused Assessment is designed for candidates applying to their first leadership positions and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Inductive Reasoning. It measures behaviors that underlie successful performance in first-line manager roles across a wide range of industries. It is most relevant to positions that supervise salaried employees. This JFA includes the Reskilling Potential Scale and the Management Potential Scale. •The Reskilling Potential scale measures tendency to learn from experiences in a way that supports professional success. •The Management Potential scale measures the potential for managerial success across industry type and functional area.",
        "Duration": "44",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, K, P",
        "Job Level": "Manager,",
        "Cleaned Description": "manager jobfocused assessment designed candidate applying first leadership position includes shls new innovative mobilefirst ability assessment verify interactive inductive reasoning measure behavior underlie successful performance firstline manager role across wide range industry relevant position supervise salaried employee jfa includes reskilling potential scale management potential scale reskilling potential scale measure tendency learn experience way support professional success management potential scale measure potential managerial success across industry type functional area",
        "cleaned_full_text": "Manager 8.0+ JFA. manager jobfocused assessment designed candidate applying first leadership position includes shls new innovative mobilefirst ability assessment verify interactive inductive reasoning measure behavior underlie successful performance firstline manager role across wide range industry relevant position supervise salaried employee jfa includes reskilling potential scale management potential scale reskilling potential scale measure tendency learn experience way support professional success management potential scale measure potential managerial success across industry type functional area"
    },
    {
        "Assessment Name": "Manufacturing Production Team Member",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manufacturing-production-team-member/",
        "Description": "The Manufacturing Production Team Member solution is designed for entry-level positions to measure the behaviors and experiences that underlie successful and safe performance in the workplace for production workers. This solution measures a candidate’s error checking abilities and general tendency to behave safely and efficiently in the workplace. The solution uses a variety of assessment types including measures of personality traits, safety-related situational judgment, and error checking. The Manufacturing Production Team Member solution is designed for selection to job titles, such as: Production Worker, Material Handler, Driver, Forklift Operator, Crewman, Mechanic, and Receiver.",
        "Duration": "35",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "manufacturing production team member solution designed entrylevel position measure behavior experience underlie successful safe performance workplace production worker solution measure candidate error checking ability general tendency behave safely efficiently workplace solution us variety assessment type including measure personality trait safetyrelated situational judgment error checking manufacturing production team member solution designed selection job title production worker material handler driver forklift operator crewman mechanic receiver",
        "cleaned_full_text": "Manufacturing Production Team Member. manufacturing production team member solution designed entrylevel position measure behavior experience underlie successful safe performance workplace production worker solution measure candidate error checking ability general tendency behave safely efficiently workplace solution us variety assessment type including measure personality trait safetyrelated situational judgment error checking manufacturing production team member solution designed selection job title production worker material handler driver forklift operator crewman mechanic receiver"
    },
    {
        "Assessment Name": "Manufacturing Skilled Maintenance Worker",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/manufacturing-skilled-maintenance-worker/",
        "Description": "The Manufacturing Skilled Maintenance solution is designed for entry-level positions to measure the behaviors and experiences that underlie successful and safe performance in the workplace. This solution measures a candidate’s mechanical comprehension abilities and general tendency to behave safely and efficiently in the workplace. This solution uses a variety of assessment types including measures of personality traits, safety-related situational judgment, and mechanical comprehension. The Manufacturing Skilled Maintenance solution is designed for selection to job titles, such as: Industrial Machinery Mechanic, Automotive Service Technician, Small Engine Mechanic, Mobile Equipment Service Technician, and Diesel Service Technician.",
        "Duration": "45",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "manufacturing skilled maintenance solution designed entrylevel position measure behavior experience underlie successful safe performance workplace solution measure candidate mechanical comprehension ability general tendency behave safely efficiently workplace solution us variety assessment type including measure personality trait safetyrelated situational judgment mechanical comprehension manufacturing skilled maintenance solution designed selection job title industrial machinery mechanic automotive service technician small engine mechanic mobile equipment service technician diesel service technician",
        "cleaned_full_text": "Manufacturing Skilled Maintenance Worker. manufacturing skilled maintenance solution designed entrylevel position measure behavior experience underlie successful safe performance workplace solution measure candidate mechanical comprehension ability general tendency behave safely efficiently workplace solution us variety assessment type including measure personality trait safetyrelated situational judgment mechanical comprehension manufacturing skilled maintenance solution designed selection job title industrial machinery mechanic automotive service technician small engine mechanic mobile equipment service technician diesel service technician"
    },
    {
        "Assessment Name": "Network Engineer/Analyst Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/network-engineeranalyst-solution/",
        "Description": "The Network Engineer/Analyst solution is designed for use with professional level telecommunications engineers and network analysts. The solution is focused on positions that involve the design and monitoring of complex telecommunications networks, and places an emphasis on reasoning ability, attention to detail, and multitasking. Sample tasks may include: designing networks or network elements, ensuring proper network operation and performance, and monitoring and troubleshooting electronic data and communication networks. Potential job titles that use this solution are: Network Engineer, Network Analyst, and Communications Engineer. There are multiple configurations of this solution available.",
        "Duration": "41",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "P, S, K, B, A",
        "Job Level": "Professional Individual Contributor,",
        "Cleaned Description": "network engineeranalyst solution designed use professional level telecommunication engineer network analyst solution focused position involve design monitoring complex telecommunication network place emphasis reasoning ability attention detail multitasking sample task may include designing network network element ensuring proper network operation performance monitoring troubleshooting electronic data communication network potential job title use solution network engineer network analyst communication engineer multiple configuration solution available",
        "cleaned_full_text": "Network Engineer/Analyst Solution. network engineeranalyst solution designed use professional level telecommunication engineer network analyst solution focused position involve design monitoring complex telecommunication network place emphasis reasoning ability attention detail multitasking sample task may include designing network network element ensuring proper network operation performance monitoring troubleshooting electronic data communication network potential job title use solution network engineer network analyst communication engineer multiple configuration solution available"
    },
    {
        "Assessment Name": "Nurse Leader Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/nurse-leader-solution/",
        "Description": "The Nurse Leader solution is an assessment used for job candidates applying to entry-level nurse leadership positions who tend to supervise hourly employees.  Sample tasks for these jobs include, but are not limited to: planning and preparing work schedules; assigning nurses to specific duties; coaching nurses on attendance, conduct, schedule adherence, and work related tasks; developing nurses' skills; training subordinates; prioritizing multiple tasks and priorities; and making day-to-day decisions with minimal guidance from others in a healthcare setting. Potential job titles that use this solution are: Nurse Leader or Nurse Manager. There are multiple configurations and versions of this solution available.",
        "Duration": "59",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "S, A, B, P",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "nurse leader solution assessment used job candidate applying entrylevel nurse leadership position tend supervise hourly employee sample task job include limited planning preparing work schedule assigning nurse specific duty coaching nurse attendance conduct schedule adherence work related task developing nurse skill training subordinate prioritizing multiple task priority making daytoday decision minimal guidance others healthcare setting potential job title use solution nurse leader nurse manager multiple configuration version solution available",
        "cleaned_full_text": "Nurse Leader Solution. nurse leader solution assessment used job candidate applying entrylevel nurse leadership position tend supervise hourly employee sample task job include limited planning preparing work schedule assigning nurse specific duty coaching nurse attendance conduct schedule adherence work related task developing nurse skill training subordinate prioritizing multiple task priority making daytoday decision minimal guidance others healthcare setting potential job title use solution nurse leader nurse manager multiple configuration version solution available"
    },
    {
        "Assessment Name": "Nurse Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/nurse-solution/",
        "Description": "The Nurse solution is for professional-level healthcare nursing positions that require licensing or registration.  Sample tasks for these jobs include, but are not limited to: assessing the health conditions of patients, documenting patients' medical information, creating a nursing care plan, and educating patients' about healthcare issues.  Potential job titles that use this solution are: Registered Nurse, Charge Nurse, Licensed Practical Nurse, and Clinic Nurse.  Multiple configurations of this solution are available.",
        "Duration": "66",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "P, A, B",
        "Job Level": "Professional Individual Contributor,",
        "Cleaned Description": "nurse solution professionallevel healthcare nursing position require licensing registration sample task job include limited assessing health condition patient documenting patient medical information creating nursing care plan educating patient healthcare issue potential job title use solution registered nurse charge nurse licensed practical nurse clinic nurse multiple configuration solution available",
        "cleaned_full_text": "Nurse Solution. nurse solution professionallevel healthcare nursing position require licensing registration sample task job include limited assessing health condition patient documenting patient medical information creating nursing care plan educating patient healthcare issue potential job title use solution registered nurse charge nurse licensed practical nurse clinic nurse multiple configuration solution available"
    },
    {
        "Assessment Name": "Nursing Assistant Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/nursing-assistant-solution/",
        "Description": "The Nursing Assistant solution is for entry-level positions in a clinic or hospital environment. Sample tasks for this job include, but are not limited to: turning and re-positioning bedridden patients, feeding patients who cannot feed themselves, and observing patients' conditions, including measuring and recording food intake.  Potential job titles that use this solution are: Certified Nursing Assistant, Nursing Aide, Patient Care Technician, and Hospital Attendant.  Multiple configurations of this solution are available.",
        "Duration": "41",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "nursing assistant solution entrylevel position clinic hospital environment sample task job include limited turning repositioning bedridden patient feeding patient feed observing patient condition including measuring recording food intake potential job title use solution certified nursing assistant nursing aide patient care technician hospital attendant multiple configuration solution available",
        "cleaned_full_text": "Nursing Assistant Solution. nursing assistant solution entrylevel position clinic hospital environment sample task job include limited turning repositioning bedridden patient feeding patient feed observing patient condition including measuring recording food intake potential job title use solution certified nursing assistant nursing aide patient care technician hospital attendant multiple configuration solution available"
    },
    {
        "Assessment Name": "Personal Banker - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/personal-banker-short-form/",
        "Description": "The Personal Banker – Loan Officer solution is for entry to mid-level financial institution positions. Sample tasks for this job would include, but are not limited to: acquiring, retaining and expanding new and existing customer relationships, discovering customer needs, making the best recommendation, completing sales, proactively contacting & meeting customers, and asking for referrals.",
        "Duration": "30",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, K, P, S",
        "Job Level": "Entry-Level, Mid-Professional,",
        "Cleaned Description": "personal banker loan officer solution entry midlevel financial institution position sample task job would include limited acquiring retaining expanding new existing customer relationship discovering customer need making best recommendation completing sale proactively contacting meeting customer asking referral",
        "cleaned_full_text": "Personal Banker - Short Form. personal banker loan officer solution entry midlevel financial institution position sample task job would include limited acquiring retaining expanding new existing customer relationship discovering customer need making best recommendation completing sale proactively contacting meeting customer asking referral"
    },
    {
        "Assessment Name": "Phone Banker - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/phone-banker-short-form/",
        "Description": "This solution is for entry to mid-level financial institution positions. Candidates are asked to answer multiple choice questions to assess learning potential, dependability, persistence and planfulness, sales focus, customer focus, and working with information.",
        "Duration": "40",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level, Mid-Professional,",
        "Cleaned Description": "solution entry midlevel financial institution position candidate asked answer multiple choice question assess learning potential dependability persistence planfulness sale focus customer focus working information",
        "cleaned_full_text": "Phone Banker - Short Form. solution entry midlevel financial institution position candidate asked answer multiple choice question assess learning potential dependability persistence planfulness sale focus customer focus working information"
    },
    {
        "Assessment Name": "Prep/Line Cook Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/prepline-cook-solution/",
        "Description": "The Prep/Line Cook solution is for entry-level food preparation positions in the hospitality industry. Sample tasks include preparing ingredients and final food items for consumption. The solution is focused on work ethic and performing quality work with no direct customer contact or sales requirements. Potential job titles that use this solution are: Cook, Line Cook, Food Preparer, Prep Cook and Chef. Multiple configurations of this solution are available.",
        "Duration": "24",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "prepline cook solution entrylevel food preparation position hospitality industry sample task include preparing ingredient final food item consumption solution focused work ethic performing quality work direct customer contact sale requirement potential job title use solution cook line cook food preparer prep cook chef multiple configuration solution available",
        "cleaned_full_text": "Prep/Line Cook Solution. prepline cook solution entrylevel food preparation position hospitality industry sample task include preparing ingredient final food item consumption solution focused work ethic performing quality work direct customer contact sale requirement potential job title use solution cook line cook food preparer prep cook chef multiple configuration solution available"
    },
    {
        "Assessment Name": "Professional + 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/professional-7-0-solution-3958/",
        "Description": "Our Professional + 7.0 solution is designed for all non-managerial professional individual contributor positions, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: gathering requirements, analyzing data, managing projects, producing products or services.\nReport Language Availability: English (USA).",
        "Duration": "51",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, C",
        "Job Level": "Mid-Professional, Professional Individual Contributor,",
        "Cleaned Description": "professional solution designed nonmanagerial professional individual contributor position includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited gathering requirement analyzing data managing project producing product service report language availability english usa",
        "cleaned_full_text": "Professional + 7.0 Solution. professional solution designed nonmanagerial professional individual contributor position includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited gathering requirement analyzing data managing project producing product service report language availability english usa"
    },
    {
        "Assessment Name": "Professional + 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/professional-7-1-%28americas%29/",
        "Description": "Our Professional + 7.1 solution is designed for all non-managerial professional individual contributor positions, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: gathering requirements, analyzing data, managing projects, producing products or services.",
        "Duration": "56",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, C, P",
        "Job Level": "General Population, Mid-Professional, Professional Individual Contributor,",
        "Cleaned Description": "professional solution designed nonmanagerial professional individual contributor position includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited gathering requirement analyzing data managing project producing product service",
        "cleaned_full_text": "Professional + 7.1 (Americas). professional solution designed nonmanagerial professional individual contributor position includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited gathering requirement analyzing data managing project producing product service"
    },
    {
        "Assessment Name": "Professional + 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/professional-7-1-solution/",
        "Description": "Our Professional + 7.1 solution is designed for all non-managerial professional individual contributor positions, and includes SHL’s new innovative mobile-first ability assessment, Verify Interactive – Deductive Reasoning. Sample tasks for these jobs include, but are not limited to: gathering requirements, analyzing data, managing projects, producing products or services.",
        "Duration": "56",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, C, P",
        "Job Level": "General Population, Mid-Professional, Professional Individual Contributor,",
        "Cleaned Description": "professional solution designed nonmanagerial professional individual contributor position includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited gathering requirement analyzing data managing project producing product service",
        "cleaned_full_text": "Professional + 7.1 (International). professional solution designed nonmanagerial professional individual contributor position includes shls new innovative mobilefirst ability assessment verify interactive deductive reasoning sample task job include limited gathering requirement analyzing data managing project producing product service"
    },
    {
        "Assessment Name": "Professional 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/professional-7-0-solution/",
        "Description": "Our Professional 7.0 solution is designed for all non-managerial professional individual contributor positions. Sample tasks for these jobs include, but are not limited to: gathering requirements, analyzing data, managing projects, producing products or services.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "33",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C",
        "Job Level": "Mid-Professional, Professional Individual Contributor,",
        "Cleaned Description": "professional solution designed nonmanagerial professional individual contributor position sample task job include limited gathering requirement analyzing data managing project producing product service report language availability english usa latin american spanish",
        "cleaned_full_text": "Professional 7.0 Solution. professional solution designed nonmanagerial professional individual contributor position sample task job include limited gathering requirement analyzing data managing project producing product service report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Professional 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/professional-7-1-solution-4247/",
        "Description": "Our Professional 7.1 solution is designed for all non-managerial professional individual contributor positions. Sample tasks for these jobs include, but are not limited to: gathering requirements, analyzing data, managing projects, producing products or services.",
        "Duration": "33",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "C, B",
        "Job Level": "Professional Individual Contributor, Mid-Professional,",
        "Cleaned Description": "professional solution designed nonmanagerial professional individual contributor position sample task job include limited gathering requirement analyzing data managing project producing product service",
        "cleaned_full_text": "Professional 7.1 (International). professional solution designed nonmanagerial professional individual contributor position sample task job include limited gathering requirement analyzing data managing project producing product service"
    },
    {
        "Assessment Name": "Professional 8.0 JFA",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/professional-8-0-jfa/",
        "Description": "The Professional 8.0 Job-Focused Assessment is designed for all non-managerial professional/individual contributor positions. It measures behaviors that underlie successful performance in a professional/individual contributor setting across a wide range of industries.",
        "Duration": "16",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, K, P",
        "Job Level": "Professional Individual Contributor,",
        "Cleaned Description": "professional jobfocused assessment designed nonmanagerial professionalindividual contributor position measure behavior underlie successful performance professionalindividual contributor setting across wide range industry",
        "cleaned_full_text": "Professional 8.0 JFA. professional jobfocused assessment designed nonmanagerial professionalindividual contributor position measure behavior underlie successful performance professionalindividual contributor setting across wide range industry"
    },
    {
        "Assessment Name": "Professional/Individual Contributor - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/professionalindividual-contributor-short-form/",
        "Description": "The Professional/Individual Contributor solution is for mid to upper-level, non-managerial positions. Sample tasks for these jobs include, but are not limited to: meeting with clients to determine their needs, analyzing data sets, and working with co-workers to complete projects. Potential job titles that use this solution are: Engineer, Human Resource Consultant, and IT Analyst.",
        "Duration": "44",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Mid-Professional, Professional Individual Contributor,",
        "Cleaned Description": "professionalindividual contributor solution mid upperlevel nonmanagerial position sample task job include limited meeting client determine need analyzing data set working coworkers complete project potential job title use solution engineer human resource consultant analyst",
        "cleaned_full_text": "Professional/Individual Contributor - Short Form. professionalindividual contributor solution mid upperlevel nonmanagerial position sample task job include limited meeting client determine need analyzing data set working coworkers complete project potential job title use solution engineer human resource consultant analyst"
    },
    {
        "Assessment Name": "Project Manager - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/project-manager-short-form/",
        "Description": "The Project Manager solution is designed for positions that lead medium to large scale projects with multiple team members involved. Sample tasks for this job include, but are not limited to: guiding, supervising, and influencing project team members, scoping project resource requirements, and managing project timelines, scope and budgets. Potential job titles that ues this solution are: Project Manager, Implementation Manager, Construction Project Manager and IT Project Manager.",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Professional Individual Contributor,",
        "Cleaned Description": "project manager solution designed position lead medium large scale project multiple team member involved sample task job include limited guiding supervising influencing project team member scoping project resource requirement managing project timeline scope budget potential job title ues solution project manager implementation manager construction project manager project manager",
        "cleaned_full_text": "Project Manager - Short Form. project manager solution designed position lead medium large scale project multiple team member involved sample task job include limited guiding supervising influencing project team member scoping project resource requirement managing project timeline scope budget potential job title ues solution project manager implementation manager construction project manager project manager"
    },
    {
        "Assessment Name": "Claims/Operations Supervisor Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/claimsoperations-supervisor-solution/",
        "Description": "The Claims/Operations Supervisor solution is for entry-level management positions that involve supervising hourly employees.  Sample tasks for this job include, but are not limited to: planning and preapring work schedules; assigning employees to specific dutites; coaching employees on attendance, conduct, schedule adherence, and work tasks; developing employees' skills; training subordinates; prioritizing multiple tasks and priorities; making day-to-day decisions with minimal guidance from others.  Potential job titles that use this solution are: Team Leader, Coach, First Line Supervisor, Claims Supervisor, Operations Supervisor, and Customer Service Supervisor.  Multiple configurations of this solution are available.",
        "Duration": "48",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "P, S, A, B",
        "Job Level": "Manager,",
        "Cleaned Description": "claimsoperations supervisor solution entrylevel management position involve supervising hourly employee sample task job include limited planning preapring work schedule assigning employee specific dutites coaching employee attendance conduct schedule adherence work task developing employee skill training subordinate prioritizing multiple task priority making daytoday decision minimal guidance others potential job title use solution team leader coach first line supervisor claim supervisor operation supervisor customer service supervisor multiple configuration solution available",
        "cleaned_full_text": "Claims/Operations Supervisor Solution. claimsoperations supervisor solution entrylevel management position involve supervising hourly employee sample task job include limited planning preapring work schedule assigning employee specific dutites coaching employee attendance conduct schedule adherence work task developing employee skill training subordinate prioritizing multiple task priority making daytoday decision minimal guidance others potential job title use solution team leader coach first line supervisor claim supervisor operation supervisor customer service supervisor multiple configuration solution available"
    },
    {
        "Assessment Name": "Contact Center Customer Service + 8.0",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/contact-center-customer-service-8-0/",
        "Description": "The Contact Center + 8.0 - Customer Service Job Focused Assessment is designed to measure the skills, competencies, and behaviors needed for success in contact center roles where the main focus is customer service. This JFA includes a mobile-optimized contact center simulation, a behavioral assessment, and a cognitive test. Together, these assessments capture the ability to provide exceptional customer service in entry-level contact center roles.",
        "Duration": "41",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, C, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "contact center customer service job focused assessment designed measure skill competency behavior needed success contact center role main focus customer service jfa includes mobileoptimized contact center simulation behavioral assessment cognitive test together assessment capture ability provide exceptional customer service entrylevel contact center role",
        "cleaned_full_text": "Contact Center Customer Service + 8.0. contact center customer service job focused assessment designed measure skill competency behavior needed success contact center role main focus customer service jfa includes mobileoptimized contact center simulation behavioral assessment cognitive test together assessment capture ability provide exceptional customer service entrylevel contact center role"
    },
    {
        "Assessment Name": "Contact Center Customer Service 8.0",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/contact-center-customer-service-8-0-4269/",
        "Description": "The Customer Service 8.0 JFA is designed for entry-level positions in a contact center environment where the main focus is customer service.",
        "Duration": "31",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "S, B, C, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "customer service jfa designed entrylevel position contact center environment main focus customer service",
        "cleaned_full_text": "Contact Center Customer Service 8.0. customer service jfa designed entrylevel position contact center environment main focus customer service"
    },
    {
        "Assessment Name": "Contact Center Manager - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/contact-center-manager-short-form/",
        "Description": "The Contact Center - Manager solution is for mid to upper-level contact center managerial positions. Sample\ntasks for these jobs include, but are not limited to: supervising and coordinating the activities of subordinates;\ninteracting day-to-day with subordinates; and training employees. Potential job titles that use this solution are:\nContact Center Team Leader, First Line Supervisor, and Contact Center Manager.",
        "Duration": "50",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Manager, Supervisor, Front Line Manager,",
        "Cleaned Description": "contact center manager solution mid upperlevel contact center managerial position sample task job include limited supervising coordinating activity subordinate interacting daytoday subordinate training employee potential job title use solution contact center team leader first line supervisor contact center manager",
        "cleaned_full_text": "Contact Center Manager - Short Form. contact center manager solution mid upperlevel contact center managerial position sample task job include limited supervising coordinating activity subordinate interacting daytoday subordinate training employee potential job title use solution contact center team leader first line supervisor contact center manager"
    },
    {
        "Assessment Name": "Contact Center Sales & Service + 8.0",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/contact-center-sales-and-service-8-0/",
        "Description": "The Contact Center + 8.0 - Sales & Service Job Focused Assessment is designed to measure the skills, competencies, and behaviors needed for success in contact center roles that involve sales-related behaviors such as recommending products or services and retaining customers. This JFA includes a mobile-optimized contact center simulation, a behavioral assessment, and a cognitive test. Together, these assessments capture the ability to provide exceptional customer service and drive sales in entry-level contact center roles.",
        "Duration": "41",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "P, B, C, A, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "contact center sale service job focused assessment designed measure skill competency behavior needed success contact center role involve salesrelated behavior recommending product service retaining customer jfa includes mobileoptimized contact center simulation behavioral assessment cognitive test together assessment capture ability provide exceptional customer service drive sale entrylevel contact center role",
        "cleaned_full_text": "Contact Center Sales & Service + 8.0. contact center sale service job focused assessment designed measure skill competency behavior needed success contact center role involve salesrelated behavior recommending product service retaining customer jfa includes mobileoptimized contact center simulation behavioral assessment cognitive test together assessment capture ability provide exceptional customer service drive sale entrylevel contact center role"
    },
    {
        "Assessment Name": "Contact Center Sales & Service 8.0",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/contact-center-sales-and-service-8-0-4268/",
        "Description": "The Sales & Service 8.0 JFA is designed for contact center roles that involve sales or sales-related behaviors such as recommending products or services and retaining customers.",
        "Duration": "31",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "S, B, C, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "sale service jfa designed contact center role involve sale salesrelated behavior recommending product service retaining customer",
        "cleaned_full_text": "Contact Center Sales & Service 8.0. sale service jfa designed contact center role involve sale salesrelated behavior recommending product service retaining customer"
    },
    {
        "Assessment Name": "Contact Center Team Lead/Coach - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/contact-center-team-leadcoach-short-form/",
        "Description": "The Contact Center - Team Lead/Coach solution is for job candidates applying to entry-level leadership\npositions who tend to supervise hourly employees. Sample tasks for these jobs include, but are not limited\nto: planning and preparing work schedules; assigning employees to specific duties; coaching employees on\nattendance, conduct, schedule adherence, and work tasks; developing employees' skills; training subordinates\nor less tenured peers; prioritizing multiple tasks and priorities; and making day-to-day decisions with minimal\nguidance from others. Potential job titles that use this solution are: Team Leader, Coach, First Line Supervisor,\nProcessing Supervisor, Call Center Supervisor, and Customer Service Supervisor.",
        "Duration": "45",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Front Line Manager, Professional Individual Contributor, Supervisor,",
        "Cleaned Description": "contact center team leadcoach solution job candidate applying entrylevel leadership position tend supervise hourly employee sample task job include limited planning preparing work schedule assigning employee specific duty coaching employee attendance conduct schedule adherence work task developing employee skill training subordinate less tenured peer prioritizing multiple task priority making daytoday decision minimal guidance others potential job title use solution team leader coach first line supervisor processing supervisor call center supervisor customer service supervisor",
        "cleaned_full_text": "Contact Center Team Lead/Coach - Short Form. contact center team leadcoach solution job candidate applying entrylevel leadership position tend supervise hourly employee sample task job include limited planning preparing work schedule assigning employee specific duty coaching employee attendance conduct schedule adherence work task developing employee skill training subordinate less tenured peer prioritizing multiple task priority making daytoday decision minimal guidance others potential job title use solution team leader coach first line supervisor processing supervisor call center supervisor customer service supervisor"
    },
    {
        "Assessment Name": "Contact Centre Agent Solution - UK",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/contact-centre-agent-solution-uk/",
        "Description": "This solution is used for job candidates applying to entry-level positions in a contact centre environment where the main focus of the job is customer service. The candidate answers multiple choice questions as well as questions in a customer call simulation environment. The solution measures: working with information, customer focus, contact centre retention, navigation, service orientation, and tactful problem solving. In addition, the solution measures data entry speed and accuracy, multi-tasking preferences, achievement orientation and conscientiousness.",
        "Duration": "39",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "solution used job candidate applying entrylevel position contact centre environment main focus job customer service candidate answer multiple choice question well question customer call simulation environment solution measure working information customer focus contact centre retention navigation service orientation tactful problem solving addition solution measure data entry speed accuracy multitasking preference achievement orientation conscientiousness",
        "cleaned_full_text": "Contact Centre Agent Solution - UK. solution used job candidate applying entrylevel position contact centre environment main focus job customer service candidate answer multiple choice question well question customer call simulation environment solution measure working information customer focus contact centre retention navigation service orientation tactful problem solving addition solution measure data entry speed accuracy multitasking preference achievement orientation conscientiousness"
    },
    {
        "Assessment Name": "Customer Service - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/customer-service-short-form/",
        "Description": "The Customer Service Representative Solution is for entry-level positions that involve a high degree of interaction with customers in person or on the phone. Sample tasks for this job include, but are not limited to: taking orders; solving product or service issues; responding positively to difficult customers; referring unresolved issues to the appropriate individuals; providing information on products and/or services. Potential job titles that use this solution are: Account Service Representative, Account Representative, Customer Service Representative, and Customer Service Agent.",
        "Duration": "42",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "customer service representative solution entrylevel position involve high degree interaction customer person phone sample task job include limited taking order solving product service issue responding positively difficult customer referring unresolved issue appropriate individual providing information product andor service potential job title use solution account service representative account representative customer service representative customer service agent",
        "cleaned_full_text": "Customer Service - Short Form. customer service representative solution entrylevel position involve high degree interaction customer person phone sample task job include limited taking order solving product service issue responding positively difficult customer referring unresolved issue appropriate individual providing information product andor service potential job title use solution account service representative account representative customer service representative customer service agent"
    },
    {
        "Assessment Name": "Customer Service - Short Form - UK",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/customer-service-short-form-uk/",
        "Description": "The Customer Service Representative solution is for entry-level positions that involve\na high degree of interaction with customers in person or on the phone. Sample tasks\nfor this job include, but are not limited to: taking orders; solving product or service\nissues; responding positively to difficult customers; referring unresolved issues to the\nappropriate individuals; providing information on products and/or services. Potential\njob titles that use this solution are: Account Service Representative, Account\nRepresentative, Customer Service Representative, and Customer Service Agent.",
        "Duration": "42",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "customer service representative solution entrylevel position involve high degree interaction customer person phone sample task job include limited taking order solving product service issue responding positively difficult customer referring unresolved issue appropriate individual providing information product andor service potential job title use solution account service representative account representative customer service representative customer service agent",
        "cleaned_full_text": "Customer Service - Short Form - UK. customer service representative solution entrylevel position involve high degree interaction customer person phone sample task job include limited taking order solving product service issue responding positively difficult customer referring unresolved issue appropriate individual providing information product andor service potential job title use solution account service representative account representative customer service representative customer service agent"
    },
    {
        "Assessment Name": "Customer Service with Sales - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/customer-service-with-sales-short-form/",
        "Description": "The Customer Service with Sales solution is for entry-level positions that involve both providing service and support to customers and selling goods and services. Sample tasks for this job include, but are not limited to: taking orders; solving product or service issues; selling products and services; responding positively to difficult customers; adding new goods and services to existing accounts; providing information on products and/or services. Potential job titles that use this solution are: Account Service Representative, Account Representative, Customer Service Representative, and Sales Representative.",
        "Duration": "44",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "customer service sale solution entrylevel position involve providing service support customer selling good service sample task job include limited taking order solving product service issue selling product service responding positively difficult customer adding new good service existing account providing information product andor service potential job title use solution account service representative account representative customer service representative sale representative",
        "cleaned_full_text": "Customer Service with Sales - Short Form. customer service sale solution entrylevel position involve providing service support customer selling good service sample task job include limited taking order solving product service issue selling product service responding positively difficult customer adding new good service existing account providing information product andor service potential job title use solution account service representative account representative customer service representative sale representative"
    },
    {
        "Assessment Name": "Director - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/director-short-form/",
        "Description": "The Director solution is intended for use with senior level positions responsible for the planning, directing, or coordinating key business activities and operations of companies. Duties and responsibilities include formulating policies, managing daily operations, and planning the use of materials and human resources. Potential job titles that use this solution are: Director, Regional Director, and Director of Operations.",
        "Duration": "69",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P",
        "Job Level": "Director,",
        "Cleaned Description": "director solution intended use senior level position responsible planning directing coordinating key business activity operation company duty responsibility include formulating policy managing daily operation planning use material human resource potential job title use solution director regional director director operation",
        "cleaned_full_text": "Director - Short Form. director solution intended use senior level position responsible planning directing coordinating key business activity operation company duty responsibility include formulating policy managing daily operation planning use material human resource potential job title use solution director regional director director operation"
    },
    {
        "Assessment Name": "Account Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/account-manager-solution/",
        "Description": "The Account Manager solution is an assessment used for job candidates applying to mid-level leadership positions that tend to manage the day-to-day operations and activities of client accounts. Sample tasks for these jobs include, but are not limited to: communicating with clients about project status, developing and maintaining project plans, coordinating internally with appropriate project personnel, and ensuring client expectations are being met. Potential job titles that use this solution are: Account Executive, Account Manager, and Senior Account Manager. There are multiple configurations of this solution available.",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "C, P, A, B",
        "Job Level": "Mid-Professional,",
        "Cleaned Description": "account manager solution assessment used job candidate applying midlevel leadership position tend manage daytoday operation activity client account sample task job include limited communicating client project status developing maintaining project plan coordinating internally appropriate project personnel ensuring client expectation met potential job title use solution account executive account manager senior account manager multiple configuration solution available",
        "cleaned_full_text": "Account Manager Solution. account manager solution assessment used job candidate applying midlevel leadership position tend manage daytoday operation activity client account sample task job include limited communicating client project status developing maintaining project plan coordinating internally appropriate project personnel ensuring client expectation met potential job title use solution account executive account manager senior account manager multiple configuration solution available"
    },
    {
        "Assessment Name": "Administrative Professional - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/administrative-professional-short-form/",
        "Description": "The Administrative Professional solution is for entry to mid-level positions that involve routine clerical and administrative functions in addition to office management functions and customer service. Sample tasks for this job include, but are not limited to: arranging conference calls; drafting correspondence; scheduling meetings; greeting visitors; coordinating office activities. Potential job titles that use this solution are: Administrative Assistant, Secretary, Office Manager, Administrative Aide, and Administrative Associate.",
        "Duration": "36",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, K, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "administrative professional solution entry midlevel position involve routine clerical administrative function addition office management function customer service sample task job include limited arranging conference call drafting correspondence scheduling meeting greeting visitor coordinating office activity potential job title use solution administrative assistant secretary office manager administrative aide administrative associate",
        "cleaned_full_text": "Administrative Professional - Short Form. administrative professional solution entry midlevel position involve routine clerical administrative function addition office management function customer service sample task job include limited arranging conference call drafting correspondence scheduling meeting greeting visitor coordinating office activity potential job title use solution administrative assistant secretary office manager administrative aide administrative associate"
    },
    {
        "Assessment Name": "Agency Manager Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/agency-manager-solution/",
        "Description": "The Agency Manager solution is for mid-level sales management positions that include front line management and sales responsibilities. Sample tasks for this job include, but are not limited to: directing and coordinating financial activities of workers in a branch, office, or department of an establishment, such as branch bank, brokerage firm, risk and insurance department, or credit department.  Potential job titles that use this solution are: Agency Manager, Brokerage Manager. Multiple configurations of this solution are available.",
        "Duration": "51",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "agency manager solution midlevel sale management position include front line management sale responsibility sample task job include limited directing coordinating financial activity worker branch office department establishment branch bank brokerage firm risk insurance department credit department potential job title use solution agency manager brokerage manager multiple configuration solution available",
        "cleaned_full_text": "Agency Manager Solution. agency manager solution midlevel sale management position include front line management sale responsibility sample task job include limited directing coordinating financial activity worker branch office department establishment branch bank brokerage firm risk insurance department credit department potential job title use solution agency manager brokerage manager multiple configuration solution available"
    },
    {
        "Assessment Name": "Apprentice + 8.0 Job Focused Assessment",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/apprentice-8-0-job-focused-assessment-4261/",
        "Description": "The Apprentice + 8.0 Job-Focused Assessment is a short, targeted, globally applicable assessment which includes a short cognitive ability measure. This assessment is designed for entry-level positions appropriate for countries and industries that use an apprenticeship model. It is intended to be used multi-nationally for organisations whose business spans across regions.",
        "Duration": "30",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, P",
        "Job Level": "General Population, Graduate, Entry-Level,",
        "Cleaned Description": "apprentice jobfocused assessment short targeted globally applicable assessment includes short cognitive ability measure assessment designed entrylevel position appropriate country industry use apprenticeship model intended used multinationally organisation whose business span across region",
        "cleaned_full_text": "Apprentice + 8.0 Job Focused Assessment. apprentice jobfocused assessment short targeted globally applicable assessment includes short cognitive ability measure assessment designed entrylevel position appropriate country industry use apprenticeship model intended used multinationally organisation whose business span across region"
    },
    {
        "Assessment Name": "Apprentice 8.0 Job Focused Assessment",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/apprentice-8-0-job-focused-assessment/",
        "Description": "The Apprentice 8.0 Job-Focused Assessment is a short, targeted, globally applicable assessment. This assessment is designed for entry-level positions appropriate for countries and industries that use an apprenticeship model. It is intended to be used multi-nationally for organizations whose business spans across regions.",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, P",
        "Job Level": "Entry-Level, General Population, Graduate,",
        "Cleaned Description": "apprentice jobfocused assessment short targeted globally applicable assessment assessment designed entrylevel position appropriate country industry use apprenticeship model intended used multinationally organization whose business span across region",
        "cleaned_full_text": "Apprentice 8.0 Job Focused Assessment. apprentice jobfocused assessment short targeted globally applicable assessment assessment designed entrylevel position appropriate country industry use apprenticeship model intended used multinationally organization whose business span across region"
    },
    {
        "Assessment Name": "Bank Administrative Assistant - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/bank-administrative-assistant-short-form/",
        "Description": "The Administrative Assistant solution is for entry-level clerical positions that interact with external or internal customers. Sample tasks for these jobs include, but are not limited to: answering telephones, managing files and records, sorting mail, greeting customers, and collaborating with co-workers on projects. Potential job titles that use this solution are: Receptionist and Administrative Assistant. There are multiple configurations of this solution available.",
        "Duration": "35",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, K, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "administrative assistant solution entrylevel clerical position interact external internal customer sample task job include limited answering telephone managing file record sorting mail greeting customer collaborating coworkers project potential job title use solution receptionist administrative assistant multiple configuration solution available",
        "cleaned_full_text": "Bank Administrative Assistant - Short Form. administrative assistant solution entrylevel clerical position interact external internal customer sample task job include limited answering telephone managing file record sorting mail greeting customer collaborating coworkers project potential job title use solution receptionist administrative assistant multiple configuration solution available"
    },
    {
        "Assessment Name": "Bank Collections Agent - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/bank-collections-agent-short-form/",
        "Description": "This solution is for entry-level collections positions in an inbound or outbound call center environment in a financial setting. Candidates answer multiple choice questions to measure achievement orientation, dependability, collector numerical skills, revenue recovery, customer focus, and persistence and planfulness. There are multiple configurations and versions of this solution available.",
        "Duration": "45",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "solution entrylevel collection position inbound outbound call center environment financial setting candidate answer multiple choice question measure achievement orientation dependability collector numerical skill revenue recovery customer focus persistence planfulness multiple configuration version solution available",
        "cleaned_full_text": "Bank Collections Agent - Short Form. solution entrylevel collection position inbound outbound call center environment financial setting candidate answer multiple choice question measure achievement orientation dependability collector numerical skill revenue recovery customer focus persistence planfulness multiple configuration version solution available"
    },
    {
        "Assessment Name": "Bank Operations Supervisor - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/bank-operations-supervisor-short-form/",
        "Description": "The Bank Operations Supervisor solution is for job candidates applying to entry-level leadership positions who tend to supervise hourly employees. Sample tasks for these jobs include, but are not limited to:  planning and preparing work schedules, assigning employees to specific duties; coaching  employees on attendance, conduct, schedule adherence, and work tasks, developing employees' skills ; training subordinates; prioritizing multiple tasks  and priorities; and making  day-to-day decisions with minimal guidance from others. Potential job titles that use this solution are: Team Leader, First Line Supervisor, Processing Supervisor, Call Center Supervisor, and Customer Service Supervisor. There are multiple configurations and versions of this solution available.",
        "Duration": "45",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, P, S",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "bank operation supervisor solution job candidate applying entrylevel leadership position tend supervise hourly employee sample task job include limited planning preparing work schedule assigning employee specific duty coaching employee attendance conduct schedule adherence work task developing employee skill training subordinate prioritizing multiple task priority making daytoday decision minimal guidance others potential job title use solution team leader first line supervisor processing supervisor call center supervisor customer service supervisor multiple configuration version solution available",
        "cleaned_full_text": "Bank Operations Supervisor - Short Form. bank operation supervisor solution job candidate applying entrylevel leadership position tend supervise hourly employee sample task job include limited planning preparing work schedule assigning employee specific duty coaching employee attendance conduct schedule adherence work task developing employee skill training subordinate prioritizing multiple task priority making daytoday decision minimal guidance others potential job title use solution team leader first line supervisor processing supervisor call center supervisor customer service supervisor multiple configuration version solution available"
    },
    {
        "Assessment Name": "Bilingual Spanish Reservation Agent Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/bilingual-spanish-reservation-agent-solution/",
        "Description": "The Bilingual Reservation Agent solution is designed for customer centered entry-level positions within the hospitality industry. Sample tasks may include making, updating, or canceling hotel reservations made in English or Spanish; listening to customers speak Spanish and entering information into a computer in English; providing information on the hotel and the services offered. Potential job titles that use this solution are: Bilingual Reservation Agent, Customer Service Representative and Reservationist. Multiple configurations of this solution are available.",
        "Duration": "43",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, P, S, A",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "bilingual reservation agent solution designed customer centered entrylevel position within hospitality industry sample task may include making updating canceling hotel reservation made english spanish listening customer speak spanish entering information computer english providing information hotel service offered potential job title use solution bilingual reservation agent customer service representative reservationist multiple configuration solution available",
        "cleaned_full_text": "Bilingual Spanish Reservation Agent Solution. bilingual reservation agent solution designed customer centered entrylevel position within hospitality industry sample task may include making updating canceling hotel reservation made english spanish listening customer speak spanish entering information computer english providing information hotel service offered potential job title use solution bilingual reservation agent customer service representative reservationist multiple configuration solution available"
    },
    {
        "Assessment Name": "Bookkeeping, Accounting, Auditing Clerk Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/bookkeeping-accounting-auditing-clerk-short-form/",
        "Description": "The Bookkeeping, Accounting, and Auditing Clerk solution is for entry-level positions that involve entering numerical data into computer systems and maintaining financial records. Sample tasks for this job include, but are not limited to: entering financial data into computers; checking financial records for accuracy; perform routine computations on financial data. Potential job titles that use this solution are: Accounting Clerk, Bookkeeper, Accounting Associate, Auditing Clerk and Accounts Receivable Clerk.",
        "Duration": "49",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "P, S, K, B, A",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "bookkeeping accounting auditing clerk solution entrylevel position involve entering numerical data computer system maintaining financial record sample task job include limited entering financial data computer checking financial record accuracy perform routine computation financial data potential job title use solution accounting clerk bookkeeper accounting associate auditing clerk account receivable clerk",
        "cleaned_full_text": "Bookkeeping, Accounting, Auditing Clerk Short Form. bookkeeping accounting auditing clerk solution entrylevel position involve entering numerical data computer system maintaining financial record sample task job include limited entering financial data computer checking financial record accuracy perform routine computation financial data potential job title use solution accounting clerk bookkeeper accounting associate auditing clerk account receivable clerk"
    },
    {
        "Assessment Name": "Branch Manager - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/branch-manager-short-form/",
        "Description": "This solution is for mid to upper-level financial institution managerial positions. Candidates answer a series of multiple choice questions to measure management potential, management judgment, leadership potential, team management, branch manager problem solving, business leadership, leadership motivation, interpersonal leadership, self leadership, and branch manager judgment. There are multiple configurations and versions of this solution available.",
        "Duration": "50",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, P",
        "Job Level": "Front Line Manager, Manager, Supervisor,",
        "Cleaned Description": "solution mid upperlevel financial institution managerial position candidate answer series multiple choice question measure management potential management judgment leadership potential team management branch manager problem solving business leadership leadership motivation interpersonal leadership self leadership branch manager judgment multiple configuration version solution available",
        "cleaned_full_text": "Branch Manager - Short Form. solution mid upperlevel financial institution managerial position candidate answer series multiple choice question measure management potential management judgment leadership potential team management branch manager problem solving business leadership leadership motivation interpersonal leadership self leadership branch manager judgment multiple configuration version solution available"
    },
    {
        "Assessment Name": "Cashier Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/cashier-solution/",
        "Description": "The Cashier solution is for entry-level retail positions in which employees receive payment in the form of cash, check, or credit cards for goods purchased. Sample tasks for these jobs include, but are not limited to: handling payments, offering customer service, and issuing receipts and refunds. Potential job titles that use this solution are: Cashier, Sales Associate, and Clerk. There are multiple configurations and versions of this solution available.",
        "Duration": "28",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, A, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "cashier solution entrylevel retail position employee receive payment form cash check credit card good purchased sample task job include limited handling payment offering customer service issuing receipt refund potential job title use solution cashier sale associate clerk multiple configuration version solution available",
        "cleaned_full_text": "Cashier Solution. cashier solution entrylevel retail position employee receive payment form cash check credit card good purchased sample task job include limited handling payment offering customer service issuing receipt refund potential job title use solution cashier sale associate clerk multiple configuration version solution available"
    },
    {
        "Assessment Name": "Teller 7.0",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/teller-7-0/",
        "Description": "Teller or cashier positions are integral to financial institutions as they conduct numerous banking transactions each day, as well as being the face of the bank to its customers. The Teller Solution contains scales that measure a person’s ability to handle money, prevent transactional errors, promote quality customer service, and generate sales or referrals appropriately.",
        "Duration": "35",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, K, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "teller cashier position integral financial institution conduct numerous banking transaction day well face bank customer teller solution contains scale measure person ability handle money prevent transactional error promote quality customer service generate sale referral appropriately",
        "cleaned_full_text": "Teller 7.0. teller cashier position integral financial institution conduct numerous banking transaction day well face bank customer teller solution contains scale measure person ability handle money prevent transactional error promote quality customer service generate sale referral appropriately"
    },
    {
        "Assessment Name": "Teller with Sales - Short Form",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/teller-with-sales-short-form/",
        "Description": "The Teller solution with Sales is for entry-level financial institution teller positions. Sample tasks for this job would include, but are not limited to: balancing currency, coin and checks, cashing checks and paying out money, entering customer transactions into computers, and suggestive selling after a customer service interaction.",
        "Duration": "35",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "A, B, K, P, S",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "teller solution sale entrylevel financial institution teller position sample task job would include limited balancing currency coin check cashing check paying money entering customer transaction computer suggestive selling customer service interaction",
        "cleaned_full_text": "Teller with Sales - Short Form. teller solution sale entrylevel financial institution teller position sample task job would include limited balancing currency coin check cashing check paying money entering customer transaction computer suggestive selling customer service interaction"
    },
    {
        "Assessment Name": "Transcriptionist Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/transcriptionist-solution/",
        "Description": "The Transcriptionist solution is for entry-level clerical roles in a healthcare environment that require employees to translate medical information.  Sample tasks for these jobs include, but are not limited to: transcribing dictated reports, deciphering medical jargon, and proofing medical reports.  Potential job titles that use this solution are: Medical Transcriptionist, Medical Transcriber, and Documentation Specialist.  Multiple configurations of this solution are available.",
        "Duration": "33",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "A, B, K, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "transcriptionist solution entrylevel clerical role healthcare environment require employee translate medical information sample task job include limited transcribing dictated report deciphering medical jargon proofing medical report potential job title use solution medical transcriptionist medical transcriber documentation specialist multiple configuration solution available",
        "cleaned_full_text": "Transcriptionist Solution. transcriptionist solution entrylevel clerical role healthcare environment require employee translate medical information sample task job include limited transcribing dictated report deciphering medical jargon proofing medical report potential job title use solution medical transcriptionist medical transcriber documentation specialist multiple configuration solution available"
    },
    {
        "Assessment Name": "Workplace Safety - Individual 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/workplace-safety-individual-7-0-solution/",
        "Description": "Our Workplace Safety - Individual 7.0 solution is designed for entry-level positions and measures the behaviors and experiences that underlie successful and safe performance with more individually-oriented roles or work environments. The solution assesses behaviors and competencies foundational to safety across a wide range of jobs, including: following policies and procedures; wearing required protective equipment; safely operating vehicles and/or machinery; taking action in unsafe situations; and producing high quality work. \nIndustries and environments with entry-level positions that use this solution are: Warehouse, Healthcare, Delivery and Logistics, Food Handling and Preparation, Assembly and Installation, Transportation, Manufacturing and Processing, Construction, Drivers, Oil and Gas, and Mining.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "16",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "workplace safety individual solution designed entrylevel position measure behavior experience underlie successful safe performance individuallyoriented role work environment solution assesses behavior competency foundational safety across wide range job including following policy procedure wearing required protective equipment safely operating vehicle andor machinery taking action unsafe situation producing high quality work industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining report language availability english usa latin american spanish",
        "cleaned_full_text": "Workplace Safety - Individual 7.0 Solution. workplace safety individual solution designed entrylevel position measure behavior experience underlie successful safe performance individuallyoriented role work environment solution assesses behavior competency foundational safety across wide range job including following policy procedure wearing required protective equipment safely operating vehicle andor machinery taking action unsafe situation producing high quality work industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Workplace Safety - Individual 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/workplace-safety-individual-7-1-solution/",
        "Description": "Our Workplace Safety - Individual 7.1 solution is designed for entry-level positions and measures the behaviors and experiences that underlie successful and safe performance with more individually-oriented roles or work environments. The solution assesses behaviors and competencies foundational to safety across a wide range of jobs, including: following policies and procedures; wearing required protective equipment; safely operating vehicles and/or machinery; taking action in unsafe situations; and producing high quality work. \nIndustries and environments with entry-level positions that use this solution are: Warehouse, Healthcare, Delivery and Logistics, Food Handling and Preparation, Assembly and Installation, Transportation, Manufacturing and Processing, Construction, Drivers, Oil and Gas, and Mining.",
        "Duration": "16",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "workplace safety individual solution designed entrylevel position measure behavior experience underlie successful safe performance individuallyoriented role work environment solution assesses behavior competency foundational safety across wide range job including following policy procedure wearing required protective equipment safely operating vehicle andor machinery taking action unsafe situation producing high quality work industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining",
        "cleaned_full_text": "Workplace Safety - Individual 7.1 (Americas). workplace safety individual solution designed entrylevel position measure behavior experience underlie successful safe performance individuallyoriented role work environment solution assesses behavior competency foundational safety across wide range job including following policy procedure wearing required protective equipment safely operating vehicle andor machinery taking action unsafe situation producing high quality work industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining"
    },
    {
        "Assessment Name": "Workplace Safety - Team 7.0 Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/workplace-safety-team-7-0-solution/",
        "Description": "The Workplace Safety – Team 7.0 solution is designed for entry-level positions to measure the competencies and experiences that underlie successful and safe performance in a team based work environment. The solution predicts the following types of behaviors and competencies foundational to safety across a wide range of jobs: wearing required protective equipment; working hard and responsibly; safely moving equipment, freight, or other materials; working and communicating effectively with others; taking action when unsafe situations occur; and following policies and procedures\nIndustries and environments with entry-level positions that use this solution are: Warehouse, Healthcare, Delivery and Logistics, Food Handling and Preparation, Assembly and Installation, Transportation, Manufacturing and Processing, Construction, Drivers, Oil and Gas, and Mining.\nReport Language Availability: English (USA), Latin American Spanish.",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B",
        "Job Level": "Director,",
        "Cleaned Description": "workplace safety team solution designed entrylevel position measure competency experience underlie successful safe performance team based work environment solution predicts following type behavior competency foundational safety across wide range job wearing required protective equipment working hard responsibly safely moving equipment freight material working communicating effectively others taking action unsafe situation occur following policy procedure industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining report language availability english usa latin american spanish",
        "cleaned_full_text": "Workplace Safety - Team 7.0 Solution. workplace safety team solution designed entrylevel position measure competency experience underlie successful safe performance team based work environment solution predicts following type behavior competency foundational safety across wide range job wearing required protective equipment working hard responsibly safely moving equipment freight material working communicating effectively others taking action unsafe situation occur following policy procedure industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining report language availability english usa latin american spanish"
    },
    {
        "Assessment Name": "Workplace Safety - Team 7.1 (Americas)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/workplace-safety-team-7-1-%28americas%29/",
        "Description": "The Workplace Safety – Team 7.1 solution is designed for entry-level positions to measure the competencies and experiences that underlie successful and safe performance in a team based work environment. The solution predicts the following types of behaviors and competencies foundational to safety across a wide range of jobs: wearing required protective equipment; working hard and responsibly; safely moving equipment, freight, or other materials; working and communicating effectively with others; taking action when unsafe situations occur; and following policies and procedures\nIndustries and environments with entry-level positions that use this solution are: Warehouse, Healthcare, Delivery and Logistics, Food Handling and Preparation, Assembly and Installation, Transportation, Manufacturing and Processing, Construction, Drivers, Oil and Gas, and Mining.",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C, P",
        "Job Level": "Entry-Level, General Population, Professional Individual Contributor,",
        "Cleaned Description": "workplace safety team solution designed entrylevel position measure competency experience underlie successful safe performance team based work environment solution predicts following type behavior competency foundational safety across wide range job wearing required protective equipment working hard responsibly safely moving equipment freight material working communicating effectively others taking action unsafe situation occur following policy procedure industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining",
        "cleaned_full_text": "Workplace Safety - Team 7.1 (Americas). workplace safety team solution designed entrylevel position measure competency experience underlie successful safe performance team based work environment solution predicts following type behavior competency foundational safety across wide range job wearing required protective equipment working hard responsibly safely moving equipment freight material working communicating effectively others taking action unsafe situation occur following policy procedure industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining"
    },
    {
        "Assessment Name": "Workplace Safety - Team 7.1 (International)",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/workplace-safety-team-7-1-solution/",
        "Description": "The Workplace Safety – Team 7.1 solution is designed for entry-level positions to measure the competencies and experiences that underlie successful and safe performance in a team based work environment. The solution predicts the following types of behaviors and competencies foundational to safety across a wide range of jobs: wearing required protective equipment; working hard and responsibly; safely moving equipment, freight, or other materials; working and communicating effectively with others; taking action when unsafe situations occur; and following policies and procedures\nIndustries and environments with entry-level positions that use this solution are: Warehouse, Healthcare, Delivery and Logistics, Food Handling and Preparation, Assembly and Installation, Transportation, Manufacturing and Processing, Construction, Drivers, Oil and Gas, and Mining.",
        "Duration": "20",
        "Remote Testing": "No",
        "Adaptive/IRT": "No",
        "Test Type": "B, C, P",
        "Job Level": "Entry-Level, General Population, Professional Individual Contributor,",
        "Cleaned Description": "workplace safety team solution designed entrylevel position measure competency experience underlie successful safe performance team based work environment solution predicts following type behavior competency foundational safety across wide range job wearing required protective equipment working hard responsibly safely moving equipment freight material working communicating effectively others taking action unsafe situation occur following policy procedure industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining",
        "cleaned_full_text": "Workplace Safety - Team 7.1 (International). workplace safety team solution designed entrylevel position measure competency experience underlie successful safe performance team based work environment solution predicts following type behavior competency foundational safety across wide range job wearing required protective equipment working hard responsibly safely moving equipment freight material working communicating effectively others taking action unsafe situation occur following policy procedure industry environment entrylevel position use solution warehouse healthcare delivery logistics food handling preparation assembly installation transportation manufacturing processing construction driver oil gas mining"
    },
    {
        "Assessment Name": "Workplace Safety Solution",
        "URL": "https://www.shl.com/solutions/products/product-catalog/view/workplace-safety-solution/",
        "Description": "The Workplace Safety Solution is designed for entry-level positions to measure the competencies and experiences that underlie successful and safe performance in the workplace. This solution measures one’s general tendency to behave safely in the workplace using a variety of assessment types including personality traits, safety-related situational judgment, and biodata. Potential job titles that use this solution are: Material Handler, Shipping Operator, Driver, Forklift Operator, Crewman, Mechanic, and Receiver.",
        "Duration": "21",
        "Remote Testing": "No",
        "Adaptive/IRT": "Yes",
        "Test Type": "B, P",
        "Job Level": "Entry-Level,",
        "Cleaned Description": "workplace safety solution designed entrylevel position measure competency experience underlie successful safe performance workplace solution measure one general tendency behave safely workplace using variety assessment type including personality trait safetyrelated situational judgment biodata potential job title use solution material handler shipping operator driver forklift operator crewman mechanic receiver",
        "cleaned_full_text": "Workplace Safety Solution. workplace safety solution designed entrylevel position measure competency experience underlie successful safe performance workplace solution measure one general tendency behave safely workplace using variety assessment type including personality trait safetyrelated situational judgment biodata potential job title use solution material handler shipping operator driver forklift operator crewman mechanic receiver"
    }
]